/* Generated by tools/symdump.py from the demo's PSX.SYM.
 * Original field names and layouts, from an EARLIER BUILD than retail.
 * Reference only -- verify offsets against the disassembly.
 */

enum AdtQuietMode {  /* size 4 */
    ADT_NORMAL = 0,
    ADT_QUIET = 1,
};

struct AfterimageType {  /* size 88 */
    struct ModelType *model;  /* +0x0 */
    struct SVECTOR vector1;  /* +0x4 */
    struct SVECTOR vector2;  /* +0xc */
    short maxn;  /* +0x14 */
    short n;  /* +0x16 */
    long *p1;  /* +0x18 */
    long *p2;  /* +0x1c */
    long sz;  /* +0x20 */
    struct POLY_GT4 poly;  /* +0x24 */
};

struct AreaNodeType {  /* size 16 */
    short y;  /* +0x0 */
    short dy;  /* +0x2 */
    short x1;  /* +0x4 */
    short z1;  /* +0x6 */
    short x2;  /* +0x8 */
    short z2;  /* +0xa */
    short attribute;  /* +0xc */
    short division;  /* +0xe */
};

struct BackGround {  /* size 72 */
    struct GsBG hundle;  /* +0x0 */
    struct GsMAP map;  /* +0x24 */
    struct GsCELL *cell;  /* +0x34 */
    unsigned long *work;  /* +0x38 */
    unsigned short *index;  /* +0x3c */
    unsigned short sz;  /* +0x40 */
    short id;  /* +0x42 */
    short attribute;  /* +0x44 */
};

struct BattleType {  /* size 16 */
    short mid;  /* +0x0 */
    short power;  /* +0x2 */
    short atks;  /* +0x4 */
    short atke;  /* +0x6 */
    short contfrm;  /* +0x8 */
    short revise;  /* +0xa */
    short ilus;  /* +0xc */
    short ilue;  /* +0xe */
};

struct BleedType {  /* size 32 */
    struct VECTOR pos;  /* +0x0 */
    struct SVECTOR vec;  /* +0x10 */
    unsigned char r;  /* +0x18 */
    unsigned char g;  /* +0x19 */
    unsigned char b;  /* +0x1a */
    unsigned char time;  /* +0x1b */
    unsigned char mode;  /* +0x1c */
};

struct BloodType {  /* size 36 */
    struct AreaNodeType *hint;  /* +0x0 */
    long px;  /* +0x4 */
    long py;  /* +0x8 */
    long pz;  /* +0xc */
    long scale;  /* +0x10 */
    long rotate;  /* +0x14 */
    short time;  /* +0x18 */
    short vx;  /* +0x1a */
    short vy;  /* +0x1c */
    short vz;  /* +0x1e */
    unsigned char mode;  /* +0x20 */
    unsigned char bright;  /* +0x21 */
};

enum CAMERA__170fake {  /* size 4 */
    CamUp = 4294966096,
};

enum CAMERA__172fake {  /* size 4 */
    MaxCriticalValiation = 3,
};

enum CAMERA__173fake {  /* size 4 */
    VSHIFT = 8,
};

enum CAMERA__174fake {  /* size 4 */
    DIV = 16,
    ROTMAX = 341,
};

enum CAMERA__176fake {  /* size 4 */
    AC = 14,
};

enum CAMERA__177fake {  /* size 4 */
    FL = 1,
    FR = 2,
};

enum CAMERA__178fake {  /* size 4 */
    FL = 1,
    FR = 2,
    BL = 4,
    BR = 8,
};

enum CHRANIM__184fake {  /* size 4 */
    CDA_ONCE = 0,
    CDA_REPEAT = 1,
};

enum CHRANIM__185fake {  /* size 4 */
    CDA_FLAG_ACTIVE = 1,
};

enum CHRANIM__187fake {  /* size 4 */
    IMG_BLOOD_STAY = 0,
    IMG_SMOKE = 1,
    IMG_BOMB0 = 2,
    IMG_BOMB1 = 3,
    IMG_BOMB2 = 4,
    IMG_SLASH = 5,
    IMG_GAUGE = 6,
    IMG_ENEMYBAR = 7,
    IMG_ICON_SYURIKEN = 8,
    IMG_ICON_POTIONS = 9,
    IMG_ICON_SMOKE = 10,
    IMG_ICON_FIRE = 11,
    IMG_ICON_MAKIBISHI = 12,
    IMG_ICON_RIKIMARUKO = 13,
    IMG_ICON_KAGINAWA = 14,
    IMG_ICON_HENSHIN = 15,
    IMG_ICON_KAWARIMI = 16,
    IMG_ICON_JIRAI = 17,
    IMG_CURSOR = 18,
    IMG_FONT_NUMBER = 19,
    IMG_KEHAI_GREEN = 20,
    IMG_SIGHT = 21,
    IMG_MISC_FIRE1 = 22,
    IMG_MISC_FIRE2 = 23,
    IMG_MISC_SNOW = 24,
    IMG_SCROLL_WATER = 25,
    IMG_SCROLL_MAGUMA = 26,
    IMG_SCROLL_SEA = 27,
    IMG_ICON_DOKUDANGO = 28,
    IMG_SPLASH = 29,
    IMG_GUNFIRE = 30,
    IMG_FRAME0 = 31,
    IMG_FRAME1 = 32,
    IMG_FRAME2 = 33,
    IMG_FRAME3 = 34,
    IMG_BLOOD_FLY = 35,
    IMG_GUARD = 36,
    IMG_HIT = 37,
    IMG_KEHAI_YELLOW = 38,
    IMG_KEHAI_RED = 39,
    IMG_GOSHIKIMAI = 40,
    IMG_ICON_GOSHIKIMAI = 41,
    IMG_ICON_HAPPOU = 42,
    IMG_ICON_NEMURI = 43,
    IMG_ICON_KAENGEKI = 44,
    IMG_ICON_SHINSOKU = 45,
    IMG_ICON_GOSIN = 46,
    IMG_ICON_MANEBUE = 47,
    IMG_ICON_NINKEN = 48,
    IMG_SCROLL_WARP = 49,
    IMG_LOADING = 50,
    IMG_TENCHU = 51,
    IMG_N = 52,
};

enum CHRANIM__188fake {  /* size 4 */
    MODEL_MON6B = 0,
    MODEL_MON6A = 1,
    MODEL_DOORZ00 = 2,
    MODEL_DOORZ01 = 3,
    MODEL_MON5B = 4,
    MODEL_MON5A = 5,
    MODEL_MONB = 6,
    MODEL_MONA = 7,
    MODEL_MON2B = 8,
    MODEL_MON2A = 9,
    MODEL_MON3B = 10,
    MODEL_MON3A = 11,
    MODEL_MON01 = 12,
    MODEL_MON00 = 13,
    MODEL_GMON01 = 14,
    MODEL_GMON00 = 15,
    MODEL_AKI01 = 16,
    MODEL_AKI00 = 17,
    MODEL_OTO_L = 18,
    MODEL_OTO_R = 19,
    MODEL_SYURIKEN = 20,
    MODEL_ARROW = 21,
    ICON_CARD1 = 22,
    ICON_CARD2 = 23,
    ICON_CARD3 = 24,
    MODEL_SHADOW = 25,
    MODEL_KAGIHEAD = 26,
    MODEL_NINGYO = 27,
    MODEL_HAPPOU = 28,
    MODEL_AKINa = 29,
    MODEL_AKINb = 30,
    MODEL_N = 31,
};

enum CHRANIM__189fake {  /* size 4 */
    MUSIC_STAGE1 = 0,
    MUSIC_STAGE2 = 1,
    MUSIC_STAGE3 = 2,
    MUSIC_STAGE4 = 3,
    MUSIC_STAGE5 = 4,
    MUSIC_STAGE6 = 5,
    MUSIC_STAGE7 = 6,
    MUSIC_STAGE8 = 7,
    MUSIC_STAGE9 = 8,
    MUSIC_GAMEOVER = 9,
    MUSIC_COMPLETE = 10,
    MUSIC_KIKI = 11,
    MUSIC_TITLE = 12,
    MUSIC_CHARA = 13,
    MUSIC_BARMAR = 14,
    MUSIC_MEIOU = 15,
    MUSIC_STAGE_OPEN1 = 16,
    MUSIC_STAGE_OPEN2 = 17,
    MUSIC_STAGE_OPEN3 = 18,
    MUSIC_STAGE_OPEN4 = 19,
    MUSIC_STAGE_OPEN5 = 20,
    MUSIC_STAGE_OPEN6 = 21,
    MUSIC_STAGE_OPEN7 = 22,
    MUSIC_STAGE_OPEN8 = 23,
    MUSIC_STAGE_OPEN7A = 24,
    MUSIC_STAGE_OPEN8A = 25,
    MUSIC_N = 26,
};

struct CRVECTOR3 {  /* size 88 */
    struct RVECTOR r01;  /* +0x0 */
    struct RVECTOR r12;  /* +0x18 */
    struct RVECTOR r20;  /* +0x30 */
    struct RVECTOR *r0;  /* +0x48 */
    struct RVECTOR *r1;  /* +0x4c */
    struct RVECTOR *r2;  /* +0x50 */
    unsigned long *rtn;  /* +0x54 */
};

struct CRVECTOR4 {  /* size 140 */
    struct RVECTOR r01;  /* +0x0 */
    struct RVECTOR r02;  /* +0x18 */
    struct RVECTOR r31;  /* +0x30 */
    struct RVECTOR r32;  /* +0x48 */
    struct RVECTOR rc;  /* +0x60 */
    struct RVECTOR *r0;  /* +0x78 */
    struct RVECTOR *r1;  /* +0x7c */
    struct RVECTOR *r2;  /* +0x80 */
    struct RVECTOR *r3;  /* +0x84 */
    unsigned long *rtn;  /* +0x88 */
};

struct CVAType {  /* size 12 */
    short mode;  /* +0x0 */
    short id;  /* +0x2 */
    short x;  /* +0x4 */
    short y;  /* +0x6 */
    short z;  /* +0x8 */
    short p;  /* +0xa */
};

struct CVECTOR {  /* size 4 */
    unsigned char r;  /* +0x0 */
    unsigned char g;  /* +0x1 */
    unsigned char b;  /* +0x2 */
    unsigned char cd;  /* +0x3 */
};

struct CdlATV {  /* size 4 */
    unsigned char val0;  /* +0x0 */
    unsigned char val1;  /* +0x1 */
    unsigned char val2;  /* +0x2 */
    unsigned char val3;  /* +0x3 */
};

struct CdlFILE {  /* size 24 */
    struct CdlLOC pos;  /* +0x0 */
    unsigned long size;  /* +0x4 */
    unsigned char name[16];  /* +0x8 */
};

struct CdlFILTER {  /* size 4 */
    unsigned char file;  /* +0x0 */
    unsigned char chan;  /* +0x1 */
    unsigned short pad;  /* +0x2 */
};

struct CdlLOC {  /* size 4 */
    unsigned char minute;  /* +0x0 */
    unsigned char second;  /* +0x1 */
    unsigned char sector;  /* +0x2 */
    unsigned char track;  /* +0x3 */
};

struct ConflictObjectType {  /* size 104 */
    struct ModelType *model;  /* +0x0 */
    struct VECTOR position;  /* +0x4 */
    struct SVECTOR offset;  /* +0x14 */
    struct SVECTOR size;  /* +0x1c */
    void *common;  /* +0x24 */
    unsigned char result[64];  /* +0x28 */
};

struct DECDCTENV {  /* size 256 */
    unsigned char iq_y[64];  /* +0x0 */
    unsigned char iq_c[64];  /* +0x40 */
    short dct[64];  /* +0x80 */
};

struct DECENV {  /* size 52 */
    unsigned long *vlcbuf[2];  /* +0x0 */
    int vlcid;  /* +0x8 */
    unsigned short *imgbuf[2];  /* +0xc */
    int imgid;  /* +0x14 */
    struct RECT rect;  /* +0x18 */
    int isAbsoluteRect;  /* +0x20 */
    struct RECT slice;  /* +0x24 */
    int isdone;  /* +0x2c */
    int is24bit;  /* +0x30 */
};

struct DIRENTRY {  /* size 40 */
    unsigned char name[20];  /* +0x0 */
    long attr;  /* +0x14 */
    long size;  /* +0x18 */
    struct DIRENTRY *next;  /* +0x1c */
    long head;  /* +0x20 */
    unsigned char system[4];  /* +0x24 */
};

struct DISPENV {  /* size 20 */
    struct RECT disp;  /* +0x0 */
    struct RECT screen;  /* +0x8 */
    unsigned char isinter;  /* +0x10 */
    unsigned char isrgb24;  /* +0x11 */
    unsigned char pad0;  /* +0x12 */
    unsigned char pad1;  /* +0x13 */
};

struct DIVPOLYGON3 {  /* size 536 */
    unsigned long ndiv;  /* +0x0 */
    unsigned long pih;  /* +0x4 */
    unsigned long piv;  /* +0x8 */
    unsigned short clut;  /* +0xc */
    unsigned short tpage;  /* +0xe */
    struct CVECTOR rgbc;  /* +0x10 */
    unsigned long *ot;  /* +0x14 */
    struct RVECTOR r0;  /* +0x18 */
    struct RVECTOR r1;  /* +0x30 */
    struct RVECTOR r2;  /* +0x48 */
    struct CRVECTOR3 cr[5];  /* +0x60 */
};

struct DIVPOLYGON4 {  /* size 820 */
    unsigned long ndiv;  /* +0x0 */
    unsigned long pih;  /* +0x4 */
    unsigned long piv;  /* +0x8 */
    unsigned short clut;  /* +0xc */
    unsigned short tpage;  /* +0xe */
    struct CVECTOR rgbc;  /* +0x10 */
    unsigned long *ot;  /* +0x14 */
    struct RVECTOR r0;  /* +0x18 */
    struct RVECTOR r1;  /* +0x30 */
    struct RVECTOR r2;  /* +0x48 */
    struct RVECTOR r3;  /* +0x60 */
    struct CRVECTOR4 cr[5];  /* +0x78 */
};

struct DRAWENV {  /* size 92 */
    struct RECT clip;  /* +0x0 */
    short ofs[2];  /* +0x8 */
    struct RECT tw;  /* +0xc */
    unsigned short tpage;  /* +0x14 */
    unsigned char dtd;  /* +0x16 */
    unsigned char dfe;  /* +0x17 */
    unsigned char isbg;  /* +0x18 */
    unsigned char r0;  /* +0x19 */
    unsigned char g0;  /* +0x1a */
    unsigned char b0;  /* +0x1b */
    struct DR_ENV dr_env;  /* +0x1c */
};

struct DR_AREA {  /* size 12 */
    unsigned long tag;  /* +0x0 */
    unsigned long code[2];  /* +0x4 */
};

struct DR_ENV {  /* size 64 */
    unsigned long tag;  /* +0x0 */
    unsigned long code[15];  /* +0x4 */
};

struct DR_LOAD {  /* size 68 */
    unsigned long tag;  /* +0x0 */
    unsigned long code[3];  /* +0x4 */
    unsigned long p[13];  /* +0x10 */
};

struct DR_MODE {  /* size 12 */
    unsigned long tag;  /* +0x0 */
    unsigned long code[2];  /* +0x4 */
};

struct DR_MOVE {  /* size 24 */
    unsigned long tag;  /* +0x0 */
    unsigned long code[5];  /* +0x4 */
};

struct DR_OFFSET {  /* size 12 */
    unsigned long tag;  /* +0x0 */
    unsigned long code[2];  /* +0x4 */
};

struct DR_STP {  /* size 12 */
    unsigned long tag;  /* +0x0 */
    unsigned long code[2];  /* +0x4 */
};

struct DR_TPAGE {  /* size 8 */
    unsigned long tag;  /* +0x0 */
    unsigned long code[1];  /* +0x4 */
};

struct DR_TWIN {  /* size 12 */
    unsigned long tag;  /* +0x0 */
    unsigned long code[2];  /* +0x4 */
};

struct DVECTOR {  /* size 4 */
    short vx;  /* +0x0 */
    short vy;  /* +0x2 */
};

enum EFFECT__144fake {  /* size 4 */
    IMG_BLOOD_STAY = 0,
    IMG_SMOKE = 1,
    IMG_BOMB0 = 2,
    IMG_BOMB1 = 3,
    IMG_BOMB2 = 4,
    IMG_SLASH = 5,
    IMG_GAUGE = 6,
    IMG_ENEMYBAR = 7,
    IMG_ICON_SYURIKEN = 8,
    IMG_ICON_POTIONS = 9,
    IMG_ICON_SMOKE = 10,
    IMG_ICON_FIRE = 11,
    IMG_ICON_MAKIBISHI = 12,
    IMG_ICON_RIKIMARUKO = 13,
    IMG_ICON_KAGINAWA = 14,
    IMG_ICON_HENSHIN = 15,
    IMG_ICON_KAWARIMI = 16,
    IMG_ICON_JIRAI = 17,
    IMG_CURSOR = 18,
    IMG_FONT_NUMBER = 19,
    IMG_KEHAI_GREEN = 20,
    IMG_SIGHT = 21,
    IMG_MISC_FIRE1 = 22,
    IMG_MISC_FIRE2 = 23,
    IMG_MISC_SNOW = 24,
    IMG_SCROLL_WATER = 25,
    IMG_SCROLL_MAGUMA = 26,
    IMG_SCROLL_SEA = 27,
    IMG_ICON_DOKUDANGO = 28,
    IMG_SPLASH = 29,
    IMG_GUNFIRE = 30,
    IMG_FRAME0 = 31,
    IMG_FRAME1 = 32,
    IMG_FRAME2 = 33,
    IMG_FRAME3 = 34,
    IMG_BLOOD_FLY = 35,
    IMG_GUARD = 36,
    IMG_HIT = 37,
    IMG_KEHAI_YELLOW = 38,
    IMG_KEHAI_RED = 39,
    IMG_GOSHIKIMAI = 40,
    IMG_ICON_GOSHIKIMAI = 41,
    IMG_ICON_HAPPOU = 42,
    IMG_ICON_NEMURI = 43,
    IMG_ICON_KAENGEKI = 44,
    IMG_ICON_SHINSOKU = 45,
    IMG_ICON_GOSIN = 46,
    IMG_ICON_MANEBUE = 47,
    IMG_ICON_NINKEN = 48,
    IMG_SCROLL_WARP = 49,
    IMG_LOADING = 50,
    IMG_TENCHU = 51,
    IMG_N = 52,
};

enum EFFECT__145fake {  /* size 4 */
    MODEL_MON6B = 0,
    MODEL_MON6A = 1,
    MODEL_DOORZ00 = 2,
    MODEL_DOORZ01 = 3,
    MODEL_MON5B = 4,
    MODEL_MON5A = 5,
    MODEL_MONB = 6,
    MODEL_MONA = 7,
    MODEL_MON2B = 8,
    MODEL_MON2A = 9,
    MODEL_MON3B = 10,
    MODEL_MON3A = 11,
    MODEL_MON01 = 12,
    MODEL_MON00 = 13,
    MODEL_GMON01 = 14,
    MODEL_GMON00 = 15,
    MODEL_AKI01 = 16,
    MODEL_AKI00 = 17,
    MODEL_OTO_L = 18,
    MODEL_OTO_R = 19,
    MODEL_SYURIKEN = 20,
    MODEL_ARROW = 21,
    ICON_CARD1 = 22,
    ICON_CARD2 = 23,
    ICON_CARD3 = 24,
    MODEL_SHADOW = 25,
    MODEL_KAGIHEAD = 26,
    MODEL_NINGYO = 27,
    MODEL_HAPPOU = 28,
    MODEL_AKINa = 29,
    MODEL_AKINb = 30,
    MODEL_N = 31,
};

enum EFFECT__146fake {  /* size 4 */
    MUSIC_STAGE1 = 0,
    MUSIC_STAGE2 = 1,
    MUSIC_STAGE3 = 2,
    MUSIC_STAGE4 = 3,
    MUSIC_STAGE5 = 4,
    MUSIC_STAGE6 = 5,
    MUSIC_STAGE7 = 6,
    MUSIC_STAGE8 = 7,
    MUSIC_STAGE9 = 8,
    MUSIC_GAMEOVER = 9,
    MUSIC_COMPLETE = 10,
    MUSIC_KIKI = 11,
    MUSIC_TITLE = 12,
    MUSIC_CHARA = 13,
    MUSIC_BARMAR = 14,
    MUSIC_MEIOU = 15,
    MUSIC_STAGE_OPEN1 = 16,
    MUSIC_STAGE_OPEN2 = 17,
    MUSIC_STAGE_OPEN3 = 18,
    MUSIC_STAGE_OPEN4 = 19,
    MUSIC_STAGE_OPEN5 = 20,
    MUSIC_STAGE_OPEN6 = 21,
    MUSIC_STAGE_OPEN7 = 22,
    MUSIC_STAGE_OPEN8 = 23,
    MUSIC_STAGE_OPEN7A = 24,
    MUSIC_STAGE_OPEN8A = 25,
    MUSIC_N = 26,
};

enum EFFECT__172fake {  /* size 4 */
    MaxImpacts = 3,
};

enum EFFECT__174fake {  /* size 4 */
    MaxFrames = 4,
};

union EFFECT__180fake {  /* size 72 */
    struct BloodType blood;  /* +0x0 */
    struct BleedType bleed;  /* +0x0 */
    struct SmokeType smoke;  /* +0x0 */
    struct ExplosionType explosion;  /* +0x0 */
    struct ExplosionType hinoko;  /* +0x0 */
    struct GoreType gore;  /* +0x0 */
    struct FlyWireType flywire;  /* +0x0 */
    struct SplashType splash;  /* +0x0 */
    struct ImpactType impact;  /* +0x0 */
    struct FrameType frame;  /* +0x0 */
};

enum EFFECT__181fake {  /* size 4 */
    SCRWORK = 768,
};

enum EFFECT__182fake {  /* size 4 */
    patch = 4096,
};

enum EFFECT__183fake {  /* size 4 */
    div = 256,
};

enum EFFECT__184fake {  /* size 4 */
    R = 80,
};

enum EFFECT__185fake {  /* size 4 */
    R = 80,
};

enum EFFECT__186fake {  /* size 4 */
    fo = 5,
};

enum EFFECT__187fake {  /* size 4 */
    fo = 30,
};

enum EFFECT__188fake {  /* size 4 */
    m = 5,
};

enum EFFECT__189fake {  /* size 4 */
    one = 4096,
};

enum EFFECT__190fake {  /* size 4 */
    SplitLen = 200,
};

enum EFFECT__191fake {  /* size 4 */
    Range = 80,
};

struct ENCSPUENV {  /* size 24 */
    short *src;  /* +0x0 */
    short *dest;  /* +0x4 */
    short *work;  /* +0x8 */
    long size;  /* +0xc */
    long loop_start;  /* +0x10 */
    unsigned char loop;  /* +0x14 */
    unsigned char byte_swap;  /* +0x15 */
    unsigned char proceed;  /* +0x16 */
    unsigned char pad4;  /* +0x17 */
};

struct EVECTOR {  /* size 44 */
    struct SVECTOR v;  /* +0x0 */
    struct VECTOR sxyz;  /* +0x8 */
    struct DVECTOR sxy;  /* +0x18 */
    struct CVECTOR rgb;  /* +0x1c */
    short txuv;  /* +0x20 */
    short pad;  /* +0x22 */
    long chx;  /* +0x24 */
    long chy;  /* +0x28 */
};

struct EXEC {  /* size 60 */
    unsigned long pc0;  /* +0x0 */
    unsigned long gp0;  /* +0x4 */
    unsigned long t_addr;  /* +0x8 */
    unsigned long t_size;  /* +0xc */
    unsigned long d_addr;  /* +0x10 */
    unsigned long d_size;  /* +0x14 */
    unsigned long b_addr;  /* +0x18 */
    unsigned long b_size;  /* +0x1c */
    unsigned long s_addr;  /* +0x20 */
    unsigned long s_size;  /* +0x24 */
    unsigned long sp;  /* +0x28 */
    unsigned long fp;  /* +0x2c */
    unsigned long gp;  /* +0x30 */
    unsigned long ret;  /* +0x34 */
    unsigned long base;  /* +0x38 */
};

struct EvCB {  /* size 28 */
    unsigned long desc;  /* +0x0 */
    long status;  /* +0x4 */
    long spec;  /* +0x8 */
    long mode;  /* +0xc */
    long (*FHandler)();  /* +0x10 */
    long system[2];  /* +0x14 */
};

struct EventSeqType {  /* size 20 */
    unsigned char id;  /* +0x0 */
    unsigned char event;  /* +0x1 */
    unsigned char next1;  /* +0x2 */
    unsigned char next2;  /* +0x3 */
    unsigned char target;  /* +0x4 */
    unsigned char mode;  /* +0x5 */
    short status;  /* +0x6 */
    short x[2];  /* +0x8 */
    short y[2];  /* +0xc */
    short z[2];  /* +0x10 */
};

struct ExplosionType {  /* size 36 */
    struct SVECTOR vec;  /* +0x0 */
    struct VECTOR pos;  /* +0x8 */
    long rotate;  /* +0x18 */
    long scale;  /* +0x1c */
    unsigned char time;  /* +0x20 */
    unsigned char mode;  /* +0x21 */
};

enum FILEIO__152fake {  /* size 4 */
    IMG_BLOOD_STAY = 0,
    IMG_SMOKE = 1,
    IMG_BOMB0 = 2,
    IMG_BOMB1 = 3,
    IMG_BOMB2 = 4,
    IMG_SLASH = 5,
    IMG_GAUGE = 6,
    IMG_ENEMYBAR = 7,
    IMG_ICON_SYURIKEN = 8,
    IMG_ICON_POTIONS = 9,
    IMG_ICON_SMOKE = 10,
    IMG_ICON_FIRE = 11,
    IMG_ICON_MAKIBISHI = 12,
    IMG_ICON_RIKIMARUKO = 13,
    IMG_ICON_KAGINAWA = 14,
    IMG_ICON_HENSHIN = 15,
    IMG_ICON_KAWARIMI = 16,
    IMG_ICON_JIRAI = 17,
    IMG_CURSOR = 18,
    IMG_FONT_NUMBER = 19,
    IMG_KEHAI_GREEN = 20,
    IMG_SIGHT = 21,
    IMG_MISC_FIRE1 = 22,
    IMG_MISC_FIRE2 = 23,
    IMG_MISC_SNOW = 24,
    IMG_SCROLL_WATER = 25,
    IMG_SCROLL_MAGUMA = 26,
    IMG_SCROLL_SEA = 27,
    IMG_ICON_DOKUDANGO = 28,
    IMG_SPLASH = 29,
    IMG_GUNFIRE = 30,
    IMG_FRAME0 = 31,
    IMG_FRAME1 = 32,
    IMG_FRAME2 = 33,
    IMG_FRAME3 = 34,
    IMG_BLOOD_FLY = 35,
    IMG_GUARD = 36,
    IMG_HIT = 37,
    IMG_KEHAI_YELLOW = 38,
    IMG_KEHAI_RED = 39,
    IMG_GOSHIKIMAI = 40,
    IMG_ICON_GOSHIKIMAI = 41,
    IMG_ICON_HAPPOU = 42,
    IMG_ICON_NEMURI = 43,
    IMG_ICON_KAENGEKI = 44,
    IMG_ICON_SHINSOKU = 45,
    IMG_ICON_GOSIN = 46,
    IMG_ICON_MANEBUE = 47,
    IMG_ICON_NINKEN = 48,
    IMG_SCROLL_WARP = 49,
    IMG_LOADING = 50,
    IMG_TENCHU = 51,
    IMG_N = 52,
};

enum FILEIO__153fake {  /* size 4 */
    MODEL_MON6B = 0,
    MODEL_MON6A = 1,
    MODEL_DOORZ00 = 2,
    MODEL_DOORZ01 = 3,
    MODEL_MON5B = 4,
    MODEL_MON5A = 5,
    MODEL_MONB = 6,
    MODEL_MONA = 7,
    MODEL_MON2B = 8,
    MODEL_MON2A = 9,
    MODEL_MON3B = 10,
    MODEL_MON3A = 11,
    MODEL_MON01 = 12,
    MODEL_MON00 = 13,
    MODEL_GMON01 = 14,
    MODEL_GMON00 = 15,
    MODEL_AKI01 = 16,
    MODEL_AKI00 = 17,
    MODEL_OTO_L = 18,
    MODEL_OTO_R = 19,
    MODEL_SYURIKEN = 20,
    MODEL_ARROW = 21,
    ICON_CARD1 = 22,
    ICON_CARD2 = 23,
    ICON_CARD3 = 24,
    MODEL_SHADOW = 25,
    MODEL_KAGIHEAD = 26,
    MODEL_NINGYO = 27,
    MODEL_HAPPOU = 28,
    MODEL_AKINa = 29,
    MODEL_AKINb = 30,
    MODEL_N = 31,
};

enum FILEIO__154fake {  /* size 4 */
    MUSIC_STAGE1 = 0,
    MUSIC_STAGE2 = 1,
    MUSIC_STAGE3 = 2,
    MUSIC_STAGE4 = 3,
    MUSIC_STAGE5 = 4,
    MUSIC_STAGE6 = 5,
    MUSIC_STAGE7 = 6,
    MUSIC_STAGE8 = 7,
    MUSIC_STAGE9 = 8,
    MUSIC_GAMEOVER = 9,
    MUSIC_COMPLETE = 10,
    MUSIC_KIKI = 11,
    MUSIC_TITLE = 12,
    MUSIC_CHARA = 13,
    MUSIC_BARMAR = 14,
    MUSIC_MEIOU = 15,
    MUSIC_STAGE_OPEN1 = 16,
    MUSIC_STAGE_OPEN2 = 17,
    MUSIC_STAGE_OPEN3 = 18,
    MUSIC_STAGE_OPEN4 = 19,
    MUSIC_STAGE_OPEN5 = 20,
    MUSIC_STAGE_OPEN6 = 21,
    MUSIC_STAGE_OPEN7 = 22,
    MUSIC_STAGE_OPEN8 = 23,
    MUSIC_STAGE_OPEN7A = 24,
    MUSIC_STAGE_OPEN8A = 25,
    MUSIC_N = 26,
};

enum FILEIO__155fake {  /* size 4 */
    CDA_ONCE = 0,
    CDA_REPEAT = 1,
};

enum FILEIO__156fake {  /* size 4 */
    CDA_FLAG_ACTIVE = 1,
};

enum FILEIO__7fake {  /* size 4 */
    AfsFlag_File = 1,
    AfsFlag_Folder = 2,
};

struct FlyWireType {  /* size 72 */
    struct VECTOR start;  /* +0x0 */
    struct VECTOR end;  /* +0x10 */
    struct VECTOR center;  /* +0x20 */
    struct VECTOR NCenter;  /* +0x30 */
    short count;  /* +0x40 */
    short time;  /* +0x42 */
    unsigned char mode;  /* +0x44 */
};

struct FrameType {  /* size 24 */
    struct _GsCOORDINATE2 *super;  /* +0x0 */
    long px;  /* +0x4 */
    long py;  /* +0x8 */
    long pz;  /* +0xc */
    short size;  /* +0x10 */
    short count;  /* +0x12 */
    unsigned char mode;  /* +0x14 */
};

struct GoreType {  /* size 32 */
    struct VECTOR pos;  /* +0x0 */
    struct SVECTOR vec;  /* +0x10 */
    long col;  /* +0x18 */
    unsigned char time;  /* +0x1c */
    unsigned char mode;  /* +0x1d */
};

struct GsADIV_F3 {  /* size 76 */
    unsigned long limit;  /* +0x0 */
    long hwd;  /* +0x4 */
    long vwd;  /* +0x8 */
    int shift;  /* +0xc */
    unsigned long *org;  /* +0x10 */
    unsigned long *pk;  /* +0x14 */
    long otz;  /* +0x18 */
    long adivz;  /* +0x1c */
    short adivw;  /* +0x20 */
    short adivh;  /* +0x22 */
    long flg;  /* +0x24 */
    short minx;  /* +0x28 */
    short miny;  /* +0x2a */
    short maxx;  /* +0x2c */
    short maxy;  /* +0x2e */
    short hwd0;  /* +0x30 */
    short vwd0;  /* +0x32 */
    unsigned long *tag;  /* +0x34 */
    struct POLY_F3 si;  /* +0x38 */
};

struct GsADIV_F4 {  /* size 84 */
    unsigned long limit;  /* +0x0 */
    long hwd;  /* +0x4 */
    long vwd;  /* +0x8 */
    int shift;  /* +0xc */
    unsigned long *org;  /* +0x10 */
    unsigned long *pk;  /* +0x14 */
    long otz;  /* +0x18 */
    long adivz;  /* +0x1c */
    short adivw;  /* +0x20 */
    short adivh;  /* +0x22 */
    long flg0;  /* +0x24 */
    long flg;  /* +0x28 */
    short minx;  /* +0x2c */
    short miny;  /* +0x2e */
    short maxx;  /* +0x30 */
    short maxy;  /* +0x32 */
    short hwd0;  /* +0x34 */
    short vwd0;  /* +0x36 */
    unsigned long *tag;  /* +0x38 */
    struct POLY_F4 si;  /* +0x3c */
};

struct GsADIV_FT3 {  /* size 88 */
    unsigned long limit;  /* +0x0 */
    long hwd;  /* +0x4 */
    long vwd;  /* +0x8 */
    int shift;  /* +0xc */
    unsigned long *org;  /* +0x10 */
    unsigned long *pk;  /* +0x14 */
    long otz;  /* +0x18 */
    long adivz;  /* +0x1c */
    short adivw;  /* +0x20 */
    short adivh;  /* +0x22 */
    long flg;  /* +0x24 */
    short minx;  /* +0x28 */
    short miny;  /* +0x2a */
    short maxx;  /* +0x2c */
    short maxy;  /* +0x2e */
    short hwd0;  /* +0x30 */
    short vwd0;  /* +0x32 */
    unsigned long *tag;  /* +0x34 */
    struct POLY_FT3 si;  /* +0x38 */
};

struct GsADIV_FT4 {  /* size 100 */
    unsigned long limit;  /* +0x0 */
    long hwd;  /* +0x4 */
    long vwd;  /* +0x8 */
    int shift;  /* +0xc */
    unsigned long *org;  /* +0x10 */
    unsigned long *pk;  /* +0x14 */
    long otz;  /* +0x18 */
    long adivz;  /* +0x1c */
    short adivw;  /* +0x20 */
    short adivh;  /* +0x22 */
    long flg0;  /* +0x24 */
    long flg;  /* +0x28 */
    short minx;  /* +0x2c */
    short miny;  /* +0x2e */
    short maxx;  /* +0x30 */
    short maxy;  /* +0x32 */
    short hwd0;  /* +0x34 */
    short vwd0;  /* +0x36 */
    unsigned long *tag;  /* +0x38 */
    struct POLY_FT4 si;  /* +0x3c */
};

struct GsADIV_G3 {  /* size 84 */
    unsigned long limit;  /* +0x0 */
    long hwd;  /* +0x4 */
    long vwd;  /* +0x8 */
    int shift;  /* +0xc */
    unsigned long *org;  /* +0x10 */
    unsigned long *pk;  /* +0x14 */
    long otz;  /* +0x18 */
    long adivz;  /* +0x1c */
    short adivw;  /* +0x20 */
    short adivh;  /* +0x22 */
    long flg;  /* +0x24 */
    short minx;  /* +0x28 */
    short miny;  /* +0x2a */
    short maxx;  /* +0x2c */
    short maxy;  /* +0x2e */
    short hwd0;  /* +0x30 */
    short vwd0;  /* +0x32 */
    unsigned long *tag;  /* +0x34 */
    struct POLY_G3 si;  /* +0x38 */
};

struct GsADIV_G4 {  /* size 96 */
    unsigned long limit;  /* +0x0 */
    long hwd;  /* +0x4 */
    long vwd;  /* +0x8 */
    int shift;  /* +0xc */
    unsigned long *org;  /* +0x10 */
    unsigned long *pk;  /* +0x14 */
    long otz;  /* +0x18 */
    long adivz;  /* +0x1c */
    short adivw;  /* +0x20 */
    short adivh;  /* +0x22 */
    long flg0;  /* +0x24 */
    long flg;  /* +0x28 */
    short minx;  /* +0x2c */
    short miny;  /* +0x2e */
    short maxx;  /* +0x30 */
    short maxy;  /* +0x32 */
    short hwd0;  /* +0x34 */
    short vwd0;  /* +0x36 */
    unsigned long *tag;  /* +0x38 */
    struct POLY_G4 si;  /* +0x3c */
};

struct GsADIV_GT3 {  /* size 96 */
    unsigned long limit;  /* +0x0 */
    long hwd;  /* +0x4 */
    long vwd;  /* +0x8 */
    int shift;  /* +0xc */
    unsigned long *org;  /* +0x10 */
    unsigned long *pk;  /* +0x14 */
    long otz;  /* +0x18 */
    long adivz;  /* +0x1c */
    short adivw;  /* +0x20 */
    short adivh;  /* +0x22 */
    long flg;  /* +0x24 */
    short minx;  /* +0x28 */
    short miny;  /* +0x2a */
    short maxx;  /* +0x2c */
    short maxy;  /* +0x2e */
    short hwd0;  /* +0x30 */
    short vwd0;  /* +0x32 */
    unsigned long *tag;  /* +0x34 */
    struct POLY_GT3 si;  /* +0x38 */
};

struct GsADIV_GT4 {  /* size 112 */
    unsigned long limit;  /* +0x0 */
    long hwd;  /* +0x4 */
    long vwd;  /* +0x8 */
    int shift;  /* +0xc */
    unsigned long *org;  /* +0x10 */
    unsigned long *pk;  /* +0x14 */
    long otz;  /* +0x18 */
    long adivz;  /* +0x1c */
    short adivw;  /* +0x20 */
    short adivh;  /* +0x22 */
    long flg0;  /* +0x24 */
    long flg;  /* +0x28 */
    short minx;  /* +0x2c */
    short miny;  /* +0x2e */
    short maxx;  /* +0x30 */
    short maxy;  /* +0x32 */
    short hwd0;  /* +0x34 */
    short vwd0;  /* +0x36 */
    unsigned long *tag;  /* +0x38 */
    struct POLY_GT4 si;  /* +0x3c */
};

struct GsADIV_P_F3 {  /* size 24 */
    struct VERT vt[3];  /* +0x0 */
};

struct GsADIV_P_F4 {  /* size 32 */
    struct VERT vt[4];  /* +0x0 */
};

struct GsADIV_P_FT3 {  /* size 24 */
    struct VERT vt[3];  /* +0x0 */
};

struct GsADIV_P_FT4 {  /* size 32 */
    struct VERT vt[4];  /* +0x0 */
};

struct GsADIV_P_G3 {  /* size 36 */
    struct VERTC vt[3];  /* +0x0 */
};

struct GsADIV_P_G4 {  /* size 48 */
    struct VERTC vt[4];  /* +0x0 */
};

struct GsADIV_P_GT3 {  /* size 36 */
    struct VERTC vt[3];  /* +0x0 */
};

struct GsADIV_P_GT4 {  /* size 48 */
    struct VERTC vt[4];  /* +0x0 */
};

struct GsARGUNIT {  /* size 20 */
    unsigned long *primp;  /* +0x0 */
    struct GsOT *tagp;  /* +0x4 */
    int shift;  /* +0x8 */
    int offset;  /* +0xc */
    unsigned char *out_packetp;  /* +0x10 */
};

struct GsARGUNIT_ANIM {  /* size 36 */
    unsigned long *primp;  /* +0x0 */
    struct GsOT *tagp;  /* +0x4 */
    int shift;  /* +0x8 */
    int offset;  /* +0xc */
    unsigned char *out_packetp;  /* +0x10 */
    long header_size;  /* +0x14 */
    unsigned long *htop;  /* +0x18 */
    unsigned long *ctop;  /* +0x1c */
    unsigned long *ptop;  /* +0x20 */
};

struct GsARGUNIT_GND {  /* size 36 */
    unsigned long *primp;  /* +0x0 */
    struct GsOT *tagp;  /* +0x4 */
    int shift;  /* +0x8 */
    int offset;  /* +0xc */
    unsigned char *out_packetp;  /* +0x10 */
    unsigned long *polytop;  /* +0x14 */
    unsigned long *boxtop;  /* +0x18 */
    unsigned long *pointtop;  /* +0x1c */
    struct SVECTOR *nortop;  /* +0x20 */
};

struct GsARGUNIT_GNDT {  /* size 40 */
    unsigned long *primp;  /* +0x0 */
    struct GsOT *tagp;  /* +0x4 */
    int shift;  /* +0x8 */
    int offset;  /* +0xc */
    unsigned char *out_packetp;  /* +0x10 */
    unsigned long *polytop;  /* +0x14 */
    unsigned long *boxtop;  /* +0x18 */
    unsigned long *pointtop;  /* +0x1c */
    struct SVECTOR *nortop;  /* +0x20 */
    unsigned long *uvtop;  /* +0x24 */
};

struct GsARGUNIT_IMAGE {  /* size 28 */
    unsigned long *primp;  /* +0x0 */
    struct GsOT *tagp;  /* +0x4 */
    int shift;  /* +0x8 */
    int offset;  /* +0xc */
    unsigned char *out_packetp;  /* +0x10 */
    unsigned long *imagetop;  /* +0x14 */
    unsigned long *cluttop;  /* +0x18 */
};

struct GsARGUNIT_JntMIMe {  /* size 40 */
    unsigned long *primp;  /* +0x0 */
    struct GsOT *tagp;  /* +0x4 */
    int shift;  /* +0x8 */
    int offset;  /* +0xc */
    unsigned char *out_packetp;  /* +0x10 */
    unsigned long *coord_sect;  /* +0x14 */
    long *mimepr;  /* +0x18 */
    unsigned long mimenum;  /* +0x1c */
    unsigned short mimeid;  /* +0x20 */
    unsigned short reserved;  /* +0x22 */
    unsigned long *mime_diff_sect;  /* +0x24 */
};

struct GsARGUNIT_NORMAL {  /* size 32 */
    unsigned long *primp;  /* +0x0 */
    struct GsOT *tagp;  /* +0x4 */
    int shift;  /* +0x8 */
    int offset;  /* +0xc */
    unsigned char *out_packetp;  /* +0x10 */
    unsigned long *primtop;  /* +0x14 */
    struct SVECTOR *vertop;  /* +0x18 */
    struct SVECTOR *nortop;  /* +0x1c */
};

struct GsARGUNIT_RstJntMIMe {  /* size 32 */
    unsigned long *primp;  /* +0x0 */
    struct GsOT *tagp;  /* +0x4 */
    int shift;  /* +0x8 */
    int offset;  /* +0xc */
    unsigned char *out_packetp;  /* +0x10 */
    unsigned long *coord_sect;  /* +0x14 */
    unsigned short mimeid;  /* +0x18 */
    unsigned short reserved;  /* +0x1a */
    unsigned long *mime_diff_sect;  /* +0x1c */
};

struct GsARGUNIT_RstVNMIMe {  /* size 40 */
    unsigned long *primp;  /* +0x0 */
    struct GsOT *tagp;  /* +0x4 */
    int shift;  /* +0x8 */
    int offset;  /* +0xc */
    unsigned char *out_packetp;  /* +0x10 */
    unsigned short mimeid;  /* +0x14 */
    unsigned short reserved;  /* +0x16 */
    unsigned long *mime_diff_sect;  /* +0x18 */
    struct SVECTOR *orgs_vn_sect;  /* +0x1c */
    struct SVECTOR *vert_sect;  /* +0x20 */
    struct SVECTOR *norm_sect;  /* +0x24 */
};

struct GsARGUNIT_SHARED {  /* size 40 */
    unsigned long *primp;  /* +0x0 */
    struct GsOT *tagp;  /* +0x4 */
    int shift;  /* +0x8 */
    int offset;  /* +0xc */
    unsigned char *out_packetp;  /* +0x10 */
    unsigned long *primtop;  /* +0x14 */
    struct SVECTOR *vertop;  /* +0x18 */
    struct GsWORKUNIT *vertop2;  /* +0x1c */
    struct SVECTOR *nortop;  /* +0x20 */
    struct SVECTOR *nortop2;  /* +0x24 */
};

struct GsARGUNIT_VNMIMe {  /* size 48 */
    unsigned long *primp;  /* +0x0 */
    struct GsOT *tagp;  /* +0x4 */
    int shift;  /* +0x8 */
    int offset;  /* +0xc */
    unsigned char *out_packetp;  /* +0x10 */
    long *mimepr;  /* +0x14 */
    unsigned long mimenum;  /* +0x18 */
    unsigned short mimeid;  /* +0x1c */
    unsigned short reserved;  /* +0x1e */
    unsigned long *mime_diff_sect;  /* +0x20 */
    struct SVECTOR *orgs_vn_sect;  /* +0x24 */
    struct SVECTOR *vert_sect;  /* +0x28 */
    struct SVECTOR *norm_sect;  /* +0x2c */
};

struct GsBG {  /* size 36 */
    unsigned long attribute;  /* +0x0 */
    short x;  /* +0x4 */
    short y;  /* +0x6 */
    short w;  /* +0x8 */
    short h;  /* +0xa */
    short scrollx;  /* +0xc */
    short scrolly;  /* +0xe */
    unsigned char r;  /* +0x10 */
    unsigned char g;  /* +0x11 */
    unsigned char b;  /* +0x12 */
    struct GsMAP *map;  /* +0x14 */
    short mx;  /* +0x18 */
    short my;  /* +0x1a */
    short scalex;  /* +0x1c */
    short scaley;  /* +0x1e */
    long rotate;  /* +0x20 */
};

struct GsBOXF {  /* size 16 */
    unsigned long attribute;  /* +0x0 */
    short x;  /* +0x4 */
    short y;  /* +0x6 */
    unsigned short w;  /* +0x8 */
    unsigned short h;  /* +0xa */
    unsigned char r;  /* +0xc */
    unsigned char g;  /* +0xd */
    unsigned char b;  /* +0xe */
};

struct GsCELL {  /* size 8 */
    unsigned char u;  /* +0x0 */
    unsigned char v;  /* +0x1 */
    unsigned short cba;  /* +0x2 */
    unsigned short flag;  /* +0x4 */
    unsigned short tpage;  /* +0x6 */
};

struct GsCOORD2PARAM {  /* size 40 */
    struct VECTOR scale;  /* +0x0 */
    struct SVECTOR rotate;  /* +0x10 */
    struct VECTOR trans;  /* +0x18 */
};

struct GsDOBJ2 {  /* size 16 */
    unsigned long attribute;  /* +0x0 */
    struct _GsCOORDINATE2 *coord2;  /* +0x4 */
    unsigned long *tmd;  /* +0x8 */
    unsigned long id;  /* +0xc */
};

struct GsDOBJ3 {  /* size 24 */
    unsigned long attribute;  /* +0x0 */
    struct _GsCOORDINATE2 *coord2;  /* +0x4 */
    unsigned long *pmd;  /* +0x8 */
    unsigned long *base;  /* +0xc */
    unsigned long *sv;  /* +0x10 */
    unsigned long id;  /* +0x14 */
};

struct GsDOBJ4 {  /* size 16 */
    unsigned long attribute;  /* +0x0 */
    struct _GsCOORDINATE2 *coord2;  /* +0x4 */
    unsigned long *tmd;  /* +0x8 */
    unsigned long id;  /* +0xc */
};

struct GsDOBJ5 {  /* size 20 */
    unsigned long attribute;  /* +0x0 */
    struct _GsCOORDINATE2 *coord2;  /* +0x4 */
    unsigned long *tmd;  /* +0x8 */
    unsigned long *packet;  /* +0xc */
    unsigned long id;  /* +0x10 */
};

struct GsFOGPARAM {  /* size 12 */
    short dqa;  /* +0x0 */
    long dqb;  /* +0x4 */
    unsigned char rfc;  /* +0x8 */
    unsigned char gfc;  /* +0x9 */
    unsigned char bfc;  /* +0xa */
};

struct GsF_LIGHT {  /* size 16 */
    int vx;  /* +0x0 */
    int vy;  /* +0x4 */
    int vz;  /* +0x8 */
    unsigned char r;  /* +0xc */
    unsigned char g;  /* +0xd */
    unsigned char b;  /* +0xe */
};

struct GsGLINE {  /* size 20 */
    unsigned long attribute;  /* +0x0 */
    short x0;  /* +0x4 */
    short y0;  /* +0x6 */
    short x1;  /* +0x8 */
    short y1;  /* +0xa */
    unsigned char r0;  /* +0xc */
    unsigned char g0;  /* +0xd */
    unsigned char b0;  /* +0xe */
    unsigned char r1;  /* +0xf */
    unsigned char g1;  /* +0x10 */
    unsigned char b1;  /* +0x11 */
};

struct GsIMAGE {  /* size 28 */
    unsigned long pmode;  /* +0x0 */
    short px;  /* +0x4 */
    short py;  /* +0x6 */
    unsigned short pw;  /* +0x8 */
    unsigned short ph;  /* +0xa */
    unsigned long *pixel;  /* +0xc */
    short cx;  /* +0x10 */
    short cy;  /* +0x12 */
    unsigned short cw;  /* +0x14 */
    unsigned short ch;  /* +0x16 */
    unsigned long *clut;  /* +0x18 */
};

struct GsLINE {  /* size 16 */
    unsigned long attribute;  /* +0x0 */
    short x0;  /* +0x4 */
    short y0;  /* +0x6 */
    short x1;  /* +0x8 */
    short y1;  /* +0xa */
    unsigned char r;  /* +0xc */
    unsigned char g;  /* +0xd */
    unsigned char b;  /* +0xe */
};

struct GsMAP {  /* size 16 */
    unsigned char cellw;  /* +0x0 */
    unsigned char cellh;  /* +0x1 */
    unsigned short ncellw;  /* +0x2 */
    unsigned short ncellh;  /* +0x4 */
    struct GsCELL *base;  /* +0x8 */
    unsigned short *index;  /* +0xc */
};

struct GsOBJTABLE2 {  /* size 12 */
    struct GsDOBJ2 *top;  /* +0x0 */
    int nobj;  /* +0x4 */
    int maxobj;  /* +0x8 */
};

struct GsOT {  /* size 20 */
    unsigned long length;  /* +0x0 */
    struct GsOT_TAG *org;  /* +0x4 */
    unsigned long offset;  /* +0x8 */
    unsigned long point;  /* +0xc */
    struct GsOT_TAG *tag;  /* +0x10 */
};

struct GsOT_TAG {  /* size 4 */
    unsigned int p : 24;  /* bit +0 */
    unsigned char num : 8;  /* bit +24 */
};

struct GsRVIEW2 {  /* size 32 */
    long vpx;  /* +0x0 */
    long vpy;  /* +0x4 */
    long vpz;  /* +0x8 */
    long vrx;  /* +0xc */
    long vry;  /* +0x10 */
    long vrz;  /* +0x14 */
    long rz;  /* +0x18 */
    struct _GsCOORDINATE2 *super;  /* +0x1c */
};

struct GsRVIEWUNIT {  /* size 32 */
    long vpx;  /* +0x0 */
    long vpy;  /* +0x4 */
    long vpz;  /* +0x8 */
    long vrx;  /* +0xc */
    long vry;  /* +0x10 */
    long vrz;  /* +0x14 */
    long rz;  /* +0x18 */
    struct _GsCOORDUNIT *super;  /* +0x1c */
};

struct GsSEH {  /* size 4 */
    short idx;  /* +0x0 */
    unsigned char sid;  /* +0x2 */
    unsigned char pad;  /* +0x3 */
};

struct GsSEQ {  /* size 28 */
    unsigned long rewrite_idx;  /* +0x0 */
    unsigned short size;  /* +0x4 */
    unsigned short num;  /* +0x6 */
    unsigned short ii;  /* +0x8 */
    unsigned short aframe;  /* +0xa */
    unsigned char sid;  /* +0xc */
    char speed;  /* +0xd */
    unsigned short srcii;  /* +0xe */
    short rframe;  /* +0x10 */
    unsigned short tframe;  /* +0x12 */
    unsigned short ci;  /* +0x14 */
    unsigned short ti;  /* +0x16 */
    unsigned short start;  /* +0x18 */
    unsigned char start_sid;  /* +0x1a */
    unsigned char traveling;  /* +0x1b */
};

struct GsSPARRAY {  /* size 72 */
    unsigned long attribute;  /* +0x0 */
    short x;  /* +0x4 */
    short y;  /* +0x6 */
    struct DR_MODE mode[2];  /* +0x8 */
    struct SPRT packet[2];  /* +0x20 */
};

struct GsSPRITE {  /* size 36 */
    unsigned long attribute;  /* +0x0 */
    short x;  /* +0x4 */
    short y;  /* +0x6 */
    unsigned short w;  /* +0x8 */
    unsigned short h;  /* +0xa */
    unsigned short tpage;  /* +0xc */
    unsigned char u;  /* +0xe */
    unsigned char v;  /* +0xf */
    short cx;  /* +0x10 */
    short cy;  /* +0x12 */
    unsigned char r;  /* +0x14 */
    unsigned char g;  /* +0x15 */
    unsigned char b;  /* +0x16 */
    short mx;  /* +0x18 */
    short my;  /* +0x1a */
    short scalex;  /* +0x1c */
    short scaley;  /* +0x1e */
    long rotate;  /* +0x20 */
};

struct GsTYPEUNIT {  /* size 8 */
    unsigned long type;  /* +0x0 */
    unsigned long *ptr;  /* +0x4 */
};

struct GsUNIT {  /* size 8 */
    struct _GsCOORDUNIT *coord;  /* +0x0 */
    unsigned long *primtop;  /* +0x4 */
};

struct GsVIEW2 {  /* size 36 */
    struct MATRIX view;  /* +0x0 */
    struct _GsCOORDINATE2 *super;  /* +0x20 */
};

struct GsVIEWUNIT {  /* size 36 */
    struct MATRIX view;  /* +0x0 */
    struct _GsCOORDUNIT *super;  /* +0x20 */
};

struct GsWORKUNIT {  /* size 8 */
    struct DVECTOR vec;  /* +0x0 */
    short otz;  /* +0x4 */
    short p;  /* +0x6 */
};

struct HumanAnimType {  /* size 8 */
    struct Humanoid *human;  /* +0x0 */
    short loop;  /* +0x4 */
    short motid;  /* +0x6 */
};

struct HumanDataType {  /* size 24 */
    short type;  /* +0x0 */
    short wepid;  /* +0x2 */
    short turn;  /* +0x4 */
    short life;  /* +0x6 */
    short width;  /* +0x8 */
    short height;  /* +0xa */
    struct MotionRegistType *mtbl;  /* +0xc */
    unsigned char *name;  /* +0x10 */
    unsigned long *model;  /* +0x14 */
};

struct Humanoid {  /* size 196 */
    short type;  /* +0x0 */
    short status;  /* +0x2 */
    short attribute;  /* +0x4 */
    short turn;  /* +0x6 */
    short life;  /* +0x8 */
    short lifemax;  /* +0xa */
    short width;  /* +0xc */
    short height;  /* +0xe */
    struct PADtype pad;  /* +0x10 */
    struct MapVector map;  /* +0x20 */
    struct VECTOR *locate;  /* +0x30 */
    struct SVECTOR *rotate;  /* +0x34 */
    struct SVECTOR vector;  /* +0x38 */
    struct VECTOR slocate;  /* +0x40 */
    struct ModelArchiveType *model;  /* +0x50 */
    struct MotionManager *motion;  /* +0x54 */
    short (*think[4])();  /* +0x58 */
    struct TraceLine *trace;  /* +0x68 */
    struct ModelType *target;  /* +0x6c */
    long point[2];  /* +0x70 */
    long chase[2];  /* +0x78 */
    unsigned char actmode;  /* +0x80 */
    unsigned char actflg;  /* +0x81 */
    unsigned char actcnt;  /* +0x82 */
    unsigned char actscnt;  /* +0x83 */
    short warid;  /* +0x84 */
    short wpatk;  /* +0x86 */
    short wepid[2];  /* +0x88 */
    struct OrnamentType *weapon[4];  /* +0x8c */
    void *illusion[2];  /* +0x9c */
    short sound;  /* +0xa4 */
    short itmctl;  /* +0xa6 */
    unsigned char item[25];  /* +0xa8 */
};

enum IMAGES__148fake {  /* size 4 */
    CDA_ONCE = 0,
    CDA_REPEAT = 1,
};

enum IMAGES__149fake {  /* size 4 */
    CDA_FLAG_ACTIVE = 1,
};

enum IMAGES__151fake {  /* size 4 */
    IMG_BLOOD_STAY = 0,
    IMG_SMOKE = 1,
    IMG_BOMB0 = 2,
    IMG_BOMB1 = 3,
    IMG_BOMB2 = 4,
    IMG_SLASH = 5,
    IMG_GAUGE = 6,
    IMG_ENEMYBAR = 7,
    IMG_ICON_SYURIKEN = 8,
    IMG_ICON_POTIONS = 9,
    IMG_ICON_SMOKE = 10,
    IMG_ICON_FIRE = 11,
    IMG_ICON_MAKIBISHI = 12,
    IMG_ICON_RIKIMARUKO = 13,
    IMG_ICON_KAGINAWA = 14,
    IMG_ICON_HENSHIN = 15,
    IMG_ICON_KAWARIMI = 16,
    IMG_ICON_JIRAI = 17,
    IMG_CURSOR = 18,
    IMG_FONT_NUMBER = 19,
    IMG_KEHAI_GREEN = 20,
    IMG_SIGHT = 21,
    IMG_MISC_FIRE1 = 22,
    IMG_MISC_FIRE2 = 23,
    IMG_MISC_SNOW = 24,
    IMG_SCROLL_WATER = 25,
    IMG_SCROLL_MAGUMA = 26,
    IMG_SCROLL_SEA = 27,
    IMG_ICON_DOKUDANGO = 28,
    IMG_SPLASH = 29,
    IMG_GUNFIRE = 30,
    IMG_FRAME0 = 31,
    IMG_FRAME1 = 32,
    IMG_FRAME2 = 33,
    IMG_FRAME3 = 34,
    IMG_BLOOD_FLY = 35,
    IMG_GUARD = 36,
    IMG_HIT = 37,
    IMG_KEHAI_YELLOW = 38,
    IMG_KEHAI_RED = 39,
    IMG_GOSHIKIMAI = 40,
    IMG_ICON_GOSHIKIMAI = 41,
    IMG_ICON_HAPPOU = 42,
    IMG_ICON_NEMURI = 43,
    IMG_ICON_KAENGEKI = 44,
    IMG_ICON_SHINSOKU = 45,
    IMG_ICON_GOSIN = 46,
    IMG_ICON_MANEBUE = 47,
    IMG_ICON_NINKEN = 48,
    IMG_SCROLL_WARP = 49,
    IMG_LOADING = 50,
    IMG_TENCHU = 51,
    IMG_N = 52,
};

enum IMAGES__152fake {  /* size 4 */
    MODEL_MON6B = 0,
    MODEL_MON6A = 1,
    MODEL_DOORZ00 = 2,
    MODEL_DOORZ01 = 3,
    MODEL_MON5B = 4,
    MODEL_MON5A = 5,
    MODEL_MONB = 6,
    MODEL_MONA = 7,
    MODEL_MON2B = 8,
    MODEL_MON2A = 9,
    MODEL_MON3B = 10,
    MODEL_MON3A = 11,
    MODEL_MON01 = 12,
    MODEL_MON00 = 13,
    MODEL_GMON01 = 14,
    MODEL_GMON00 = 15,
    MODEL_AKI01 = 16,
    MODEL_AKI00 = 17,
    MODEL_OTO_L = 18,
    MODEL_OTO_R = 19,
    MODEL_SYURIKEN = 20,
    MODEL_ARROW = 21,
    ICON_CARD1 = 22,
    ICON_CARD2 = 23,
    ICON_CARD3 = 24,
    MODEL_SHADOW = 25,
    MODEL_KAGIHEAD = 26,
    MODEL_NINGYO = 27,
    MODEL_HAPPOU = 28,
    MODEL_AKINa = 29,
    MODEL_AKINb = 30,
    MODEL_N = 31,
};

enum IMAGES__153fake {  /* size 4 */
    MUSIC_STAGE1 = 0,
    MUSIC_STAGE2 = 1,
    MUSIC_STAGE3 = 2,
    MUSIC_STAGE4 = 3,
    MUSIC_STAGE5 = 4,
    MUSIC_STAGE6 = 5,
    MUSIC_STAGE7 = 6,
    MUSIC_STAGE8 = 7,
    MUSIC_STAGE9 = 8,
    MUSIC_GAMEOVER = 9,
    MUSIC_COMPLETE = 10,
    MUSIC_KIKI = 11,
    MUSIC_TITLE = 12,
    MUSIC_CHARA = 13,
    MUSIC_BARMAR = 14,
    MUSIC_MEIOU = 15,
    MUSIC_STAGE_OPEN1 = 16,
    MUSIC_STAGE_OPEN2 = 17,
    MUSIC_STAGE_OPEN3 = 18,
    MUSIC_STAGE_OPEN4 = 19,
    MUSIC_STAGE_OPEN5 = 20,
    MUSIC_STAGE_OPEN6 = 21,
    MUSIC_STAGE_OPEN7 = 22,
    MUSIC_STAGE_OPEN8 = 23,
    MUSIC_STAGE_OPEN7A = 24,
    MUSIC_STAGE_OPEN8A = 25,
    MUSIC_N = 26,
};

enum IMAGES__157fake {  /* size 4 */
    OFFSET = 150,
};

enum INFOVIEW__180fake {  /* size 4 */
    IMG_BLOOD_STAY = 0,
    IMG_SMOKE = 1,
    IMG_BOMB0 = 2,
    IMG_BOMB1 = 3,
    IMG_BOMB2 = 4,
    IMG_SLASH = 5,
    IMG_GAUGE = 6,
    IMG_ENEMYBAR = 7,
    IMG_ICON_SYURIKEN = 8,
    IMG_ICON_POTIONS = 9,
    IMG_ICON_SMOKE = 10,
    IMG_ICON_FIRE = 11,
    IMG_ICON_MAKIBISHI = 12,
    IMG_ICON_RIKIMARUKO = 13,
    IMG_ICON_KAGINAWA = 14,
    IMG_ICON_HENSHIN = 15,
    IMG_ICON_KAWARIMI = 16,
    IMG_ICON_JIRAI = 17,
    IMG_CURSOR = 18,
    IMG_FONT_NUMBER = 19,
    IMG_KEHAI_GREEN = 20,
    IMG_SIGHT = 21,
    IMG_MISC_FIRE1 = 22,
    IMG_MISC_FIRE2 = 23,
    IMG_MISC_SNOW = 24,
    IMG_SCROLL_WATER = 25,
    IMG_SCROLL_MAGUMA = 26,
    IMG_SCROLL_SEA = 27,
    IMG_ICON_DOKUDANGO = 28,
    IMG_SPLASH = 29,
    IMG_GUNFIRE = 30,
    IMG_FRAME0 = 31,
    IMG_FRAME1 = 32,
    IMG_FRAME2 = 33,
    IMG_FRAME3 = 34,
    IMG_BLOOD_FLY = 35,
    IMG_GUARD = 36,
    IMG_HIT = 37,
    IMG_KEHAI_YELLOW = 38,
    IMG_KEHAI_RED = 39,
    IMG_GOSHIKIMAI = 40,
    IMG_ICON_GOSHIKIMAI = 41,
    IMG_ICON_HAPPOU = 42,
    IMG_ICON_NEMURI = 43,
    IMG_ICON_KAENGEKI = 44,
    IMG_ICON_SHINSOKU = 45,
    IMG_ICON_GOSIN = 46,
    IMG_ICON_MANEBUE = 47,
    IMG_ICON_NINKEN = 48,
    IMG_SCROLL_WARP = 49,
    IMG_LOADING = 50,
    IMG_TENCHU = 51,
    IMG_N = 52,
};

enum INFOVIEW__181fake {  /* size 4 */
    MODEL_MON6B = 0,
    MODEL_MON6A = 1,
    MODEL_DOORZ00 = 2,
    MODEL_DOORZ01 = 3,
    MODEL_MON5B = 4,
    MODEL_MON5A = 5,
    MODEL_MONB = 6,
    MODEL_MONA = 7,
    MODEL_MON2B = 8,
    MODEL_MON2A = 9,
    MODEL_MON3B = 10,
    MODEL_MON3A = 11,
    MODEL_MON01 = 12,
    MODEL_MON00 = 13,
    MODEL_GMON01 = 14,
    MODEL_GMON00 = 15,
    MODEL_AKI01 = 16,
    MODEL_AKI00 = 17,
    MODEL_OTO_L = 18,
    MODEL_OTO_R = 19,
    MODEL_SYURIKEN = 20,
    MODEL_ARROW = 21,
    ICON_CARD1 = 22,
    ICON_CARD2 = 23,
    ICON_CARD3 = 24,
    MODEL_SHADOW = 25,
    MODEL_KAGIHEAD = 26,
    MODEL_NINGYO = 27,
    MODEL_HAPPOU = 28,
    MODEL_AKINa = 29,
    MODEL_AKINb = 30,
    MODEL_N = 31,
};

enum INFOVIEW__182fake {  /* size 4 */
    MUSIC_STAGE1 = 0,
    MUSIC_STAGE2 = 1,
    MUSIC_STAGE3 = 2,
    MUSIC_STAGE4 = 3,
    MUSIC_STAGE5 = 4,
    MUSIC_STAGE6 = 5,
    MUSIC_STAGE7 = 6,
    MUSIC_STAGE8 = 7,
    MUSIC_STAGE9 = 8,
    MUSIC_GAMEOVER = 9,
    MUSIC_COMPLETE = 10,
    MUSIC_KIKI = 11,
    MUSIC_TITLE = 12,
    MUSIC_CHARA = 13,
    MUSIC_BARMAR = 14,
    MUSIC_MEIOU = 15,
    MUSIC_STAGE_OPEN1 = 16,
    MUSIC_STAGE_OPEN2 = 17,
    MUSIC_STAGE_OPEN3 = 18,
    MUSIC_STAGE_OPEN4 = 19,
    MUSIC_STAGE_OPEN5 = 20,
    MUSIC_STAGE_OPEN6 = 21,
    MUSIC_STAGE_OPEN7 = 22,
    MUSIC_STAGE_OPEN8 = 23,
    MUSIC_STAGE_OPEN7A = 24,
    MUSIC_STAGE_OPEN8A = 25,
    MUSIC_N = 26,
};

enum INFOVIEW__191fake {  /* size 4 */
    CDA_ONCE = 0,
    CDA_REPEAT = 1,
};

enum INFOVIEW__192fake {  /* size 4 */
    CDA_FLAG_ACTIVE = 1,
};

enum INFOVIEW__195fake {  /* size 4 */
    nLifeBarStyle = 2,
};

struct INFOVIEW__196fake {  /* size 64 */
    int bx;  /* +0x0 */
    int by;  /* +0x4 */
    int bw;  /* +0x8 */
    int bh;  /* +0xc */
    int tx;  /* +0x10 */
    int ty;  /* +0x14 */
    unsigned char ImageID;  /* +0x18 */
    struct GsSPRITE sprite;  /* +0x1c */
};

enum INFOVIEW__197fake {  /* size 4 */
    nLifeBar = 4,
};

struct INFOVIEW__198fake {  /* size 20 */
    struct Humanoid *target;  /* +0x0 */
    int life;  /* +0x4 */
    int max;  /* +0x8 */
    int count;  /* +0xc */
    int style;  /* +0x10 */
};

enum INFOVIEW__199fake {  /* size 4 */
    NW = 4,
};

enum INFOVIEW__200fake {  /* size 4 */
    GAP = 6,
};

enum INFOVIEW__201fake {  /* size 4 */
    speed = 30,
};

enum INFOVIEW__202fake {  /* size 4 */
    range = 255,
    powrange = 20000,
};

enum INFOVIEW__203fake {  /* size 4 */
    X = 4294967242,
    Y = 100,
};

enum INFOVIEW__204fake {  /* size 4 */
    X = 4294967176,
    Y = 4294967206,
    GAP = 70,
};

enum INFOVIEW__205fake {  /* size 4 */
    ItemX = 140,
    ItemY = 100,
    ItemGap = 20,
};

enum INFOVIEW__207fake {  /* size 4 */
    BLOCKSIZE = 8192,
};

enum INFOVIEW__208fake {  /* size 4 */
    SELECT = 0,
    ADD = 1,
    RESET = 2,
};

enum INFOVIEW__209fake {  /* size 4 */
    MAX = 30,
};

enum INFOVIEW__210fake {  /* size 4 */
    ADD = 0,
    REMOVE = 1,
    RESET = 2,
    GO = 3,
    CLEAR = 4,
    SET_PATH = 5,
    REPORT = 6,
    CAMERA = 7,
};

enum INFOVIEW__211fake {  /* size 4 */
    SET = 0,
    CLEAR = 1,
};

enum INFOVIEW__212fake {  /* size 4 */
    SAVE = 0,
    LOAD = 1,
    STOCK_IMAGES = 2,
    DEBUG_PRINT = 3,
    PLAY_MUSIC = 4,
    STOP_MUSIC = 5,
    EVENT_UPDATE = 6,
    ANIM_UPDATE = 7,
    TEST_MUSIC = 8,
    EASY_GAME = 9,
    HARD_GAME = 10,
};

enum INFOVIEW__213fake {  /* size 4 */
    ENESIZE = 5000,
    ITEMSIZE = 2000,
};

enum INFOVIEW__214fake {  /* size 4 */
    RESET = 0,
    RESURRECT = 1,
};

enum INFOVIEW__215fake {  /* size 4 */
    START = 2048,
    SELECT = 256,
};

enum INFOVIEW__216fake {  /* size 4 */
    size = 4096,
};

enum INFOVIEW__217fake {  /* size 4 */
    TESTPAD = 3,
};

enum INFOVIEW__218fake {  /* size 4 */
    ENEMY = 0,
    ITEM = 1,
    CHARGE = 2,
    FILE = 3,
    PLAYER = 4,
    STAGE = 5,
};

enum ITEM__164fake {  /* size 4 */
    IMG_BLOOD_STAY = 0,
    IMG_SMOKE = 1,
    IMG_BOMB0 = 2,
    IMG_BOMB1 = 3,
    IMG_BOMB2 = 4,
    IMG_SLASH = 5,
    IMG_GAUGE = 6,
    IMG_ENEMYBAR = 7,
    IMG_ICON_SYURIKEN = 8,
    IMG_ICON_POTIONS = 9,
    IMG_ICON_SMOKE = 10,
    IMG_ICON_FIRE = 11,
    IMG_ICON_MAKIBISHI = 12,
    IMG_ICON_RIKIMARUKO = 13,
    IMG_ICON_KAGINAWA = 14,
    IMG_ICON_HENSHIN = 15,
    IMG_ICON_KAWARIMI = 16,
    IMG_ICON_JIRAI = 17,
    IMG_CURSOR = 18,
    IMG_FONT_NUMBER = 19,
    IMG_KEHAI_GREEN = 20,
    IMG_SIGHT = 21,
    IMG_MISC_FIRE1 = 22,
    IMG_MISC_FIRE2 = 23,
    IMG_MISC_SNOW = 24,
    IMG_SCROLL_WATER = 25,
    IMG_SCROLL_MAGUMA = 26,
    IMG_SCROLL_SEA = 27,
    IMG_ICON_DOKUDANGO = 28,
    IMG_SPLASH = 29,
    IMG_GUNFIRE = 30,
    IMG_FRAME0 = 31,
    IMG_FRAME1 = 32,
    IMG_FRAME2 = 33,
    IMG_FRAME3 = 34,
    IMG_BLOOD_FLY = 35,
    IMG_GUARD = 36,
    IMG_HIT = 37,
    IMG_KEHAI_YELLOW = 38,
    IMG_KEHAI_RED = 39,
    IMG_GOSHIKIMAI = 40,
    IMG_ICON_GOSHIKIMAI = 41,
    IMG_ICON_HAPPOU = 42,
    IMG_ICON_NEMURI = 43,
    IMG_ICON_KAENGEKI = 44,
    IMG_ICON_SHINSOKU = 45,
    IMG_ICON_GOSIN = 46,
    IMG_ICON_MANEBUE = 47,
    IMG_ICON_NINKEN = 48,
    IMG_SCROLL_WARP = 49,
    IMG_LOADING = 50,
    IMG_TENCHU = 51,
    IMG_N = 52,
};

enum ITEM__165fake {  /* size 4 */
    MODEL_MON6B = 0,
    MODEL_MON6A = 1,
    MODEL_DOORZ00 = 2,
    MODEL_DOORZ01 = 3,
    MODEL_MON5B = 4,
    MODEL_MON5A = 5,
    MODEL_MONB = 6,
    MODEL_MONA = 7,
    MODEL_MON2B = 8,
    MODEL_MON2A = 9,
    MODEL_MON3B = 10,
    MODEL_MON3A = 11,
    MODEL_MON01 = 12,
    MODEL_MON00 = 13,
    MODEL_GMON01 = 14,
    MODEL_GMON00 = 15,
    MODEL_AKI01 = 16,
    MODEL_AKI00 = 17,
    MODEL_OTO_L = 18,
    MODEL_OTO_R = 19,
    MODEL_SYURIKEN = 20,
    MODEL_ARROW = 21,
    ICON_CARD1 = 22,
    ICON_CARD2 = 23,
    ICON_CARD3 = 24,
    MODEL_SHADOW = 25,
    MODEL_KAGIHEAD = 26,
    MODEL_NINGYO = 27,
    MODEL_HAPPOU = 28,
    MODEL_AKINa = 29,
    MODEL_AKINb = 30,
    MODEL_N = 31,
};

enum ITEM__166fake {  /* size 4 */
    MUSIC_STAGE1 = 0,
    MUSIC_STAGE2 = 1,
    MUSIC_STAGE3 = 2,
    MUSIC_STAGE4 = 3,
    MUSIC_STAGE5 = 4,
    MUSIC_STAGE6 = 5,
    MUSIC_STAGE7 = 6,
    MUSIC_STAGE8 = 7,
    MUSIC_STAGE9 = 8,
    MUSIC_GAMEOVER = 9,
    MUSIC_COMPLETE = 10,
    MUSIC_KIKI = 11,
    MUSIC_TITLE = 12,
    MUSIC_CHARA = 13,
    MUSIC_BARMAR = 14,
    MUSIC_MEIOU = 15,
    MUSIC_STAGE_OPEN1 = 16,
    MUSIC_STAGE_OPEN2 = 17,
    MUSIC_STAGE_OPEN3 = 18,
    MUSIC_STAGE_OPEN4 = 19,
    MUSIC_STAGE_OPEN5 = 20,
    MUSIC_STAGE_OPEN6 = 21,
    MUSIC_STAGE_OPEN7 = 22,
    MUSIC_STAGE_OPEN8 = 23,
    MUSIC_STAGE_OPEN7A = 24,
    MUSIC_STAGE_OPEN8A = 25,
    MUSIC_N = 26,
};

enum ITEM__182fake {  /* size 4 */
    KORO_NORMAL = 0,
    KORO_WATER = 1,
    KORO_GRAND = 2,
    KORO_WALL = 3,
    KORO_STAY = 4,
};

union ITEM__184fake {  /* size 40 */
    struct tag_fly fly;  /* +0x0 */
    struct param_korogari koro;  /* +0x0 */
};

struct ITEM__201fake {  /* size 12 */
    int mode;  /* +0x0 */
    int pause;  /* +0x4 */
    short size;  /* +0x8 */
    short ofsY;  /* +0xa */
};

union ITEM__202fake {  /* size 52 */
    struct param_launch launch;  /* +0x0 */
    struct param_smoke smoke;  /* +0x0 */
    struct param_drop drop;  /* +0x0 */
    struct param_gun gun;  /* +0x0 */
    struct param_arrow arrow;  /* +0x0 */
    struct param_napalm napalm;  /* +0x0 */
    struct param_ningyo ningyo;  /* +0x0 */
    struct param_goshikimai goshikimai;  /* +0x0 */
    struct param_ninken ninken;  /* +0x0 */
    struct param_dokudango dokudango;  /* +0x0 */
    struct param_drop kusuri;  /* +0x0 */
    struct param_kaengeki kaengeki;  /* +0x0 */
    struct param_henshin henshin;  /* +0x0 */
    struct param_lightningbolt lightningbolt;  /* +0x0 */
    struct param_gosin gosin;  /* +0x0 */
    struct param_shinsoku shinsoku;  /* +0x0 */
};

enum ITEM__203fake {  /* size 4 */
    ITEM_MODE_DISPOSE = 255,
};

enum ITEM__205fake {  /* size 4 */
    rangex = 64,
    rangey = 128,
};

enum ITEM__207fake {  /* size 4 */
    one = 4096,
};

enum ITEM__208fake {  /* size 4 */
    R = 100,
};

enum ITEM__209fake {  /* size 4 */
    R = 100,
};

struct ITEM__210fake {  /* size 2 */
    unsigned char type[2];  /* +0x0 */
};

enum ITEM__211fake {  /* size 4 */
    NoUse = 4294966297,
    N = 15,
    TargetN = 30,
};

struct ITEM__212fake {  /* size 12 */
    unsigned long *tmd;  /* +0x0 */
    short x;  /* +0x4 */
    short y;  /* +0x6 */
    short z;  /* +0x8 */
};

struct ITEM__213fake {  /* size 184 */
    int waist;  /* +0x0 */
    struct ITEM__212fake p[15];  /* +0x4 */
};

enum ITEM__214fake {  /* size 4 */
    R = 256,
};

enum ITEM__215fake {  /* size 4 */
    nr = 25,
};

enum ITEM__216fake {  /* size 4 */
    MaxCount = 100,
};

enum ITEM__217fake {  /* size 4 */
    R = 20,
};

enum ITEM__218fake {  /* size 4 */
    MaxCount = 20,
};

enum ITEM__219fake {  /* size 4 */
    LEN = 15000,
};

enum ITEM__220fake {  /* size 4 */
    n = 3,
};

enum ITEM__221fake {  /* size 4 */
    D = 100,
    D2 = 50,
};

struct ImpactType {  /* size 16 */
    long px;  /* +0x0 */
    long py;  /* +0x4 */
    long pz;  /* +0x8 */
    short size;  /* +0xc */
    unsigned char type;  /* +0xe */
    unsigned char count;  /* +0xf */
};

struct IndexArrayType {  /* size 36 */
    long index;  /* +0x0 */
    short array[4][4];  /* +0x4 */
};

struct LINE_F2 {  /* size 16 */
    unsigned long tag;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    short x0;  /* +0x8 */
    short y0;  /* +0xa */
    short x1;  /* +0xc */
    short y1;  /* +0xe */
};

struct LINE_F3 {  /* size 24 */
    unsigned long tag;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    short x0;  /* +0x8 */
    short y0;  /* +0xa */
    short x1;  /* +0xc */
    short y1;  /* +0xe */
    short x2;  /* +0x10 */
    short y2;  /* +0x12 */
    unsigned long pad;  /* +0x14 */
};

struct LINE_F4 {  /* size 28 */
    unsigned long tag;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    short x0;  /* +0x8 */
    short y0;  /* +0xa */
    short x1;  /* +0xc */
    short y1;  /* +0xe */
    short x2;  /* +0x10 */
    short y2;  /* +0x12 */
    short x3;  /* +0x14 */
    short y3;  /* +0x16 */
    unsigned long pad;  /* +0x18 */
};

struct LINE_G2 {  /* size 20 */
    unsigned long tag;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    short x0;  /* +0x8 */
    short y0;  /* +0xa */
    unsigned char r1;  /* +0xc */
    unsigned char g1;  /* +0xd */
    unsigned char b1;  /* +0xe */
    unsigned char p1;  /* +0xf */
    short x1;  /* +0x10 */
    short y1;  /* +0x12 */
};

struct LINE_G3 {  /* size 32 */
    unsigned long tag;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    short x0;  /* +0x8 */
    short y0;  /* +0xa */
    unsigned char r1;  /* +0xc */
    unsigned char g1;  /* +0xd */
    unsigned char b1;  /* +0xe */
    unsigned char p1;  /* +0xf */
    short x1;  /* +0x10 */
    short y1;  /* +0x12 */
    unsigned char r2;  /* +0x14 */
    unsigned char g2;  /* +0x15 */
    unsigned char b2;  /* +0x16 */
    unsigned char p2;  /* +0x17 */
    short x2;  /* +0x18 */
    short y2;  /* +0x1a */
    unsigned long pad;  /* +0x1c */
};

struct LINE_G4 {  /* size 40 */
    unsigned long tag;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    short x0;  /* +0x8 */
    short y0;  /* +0xa */
    unsigned char r1;  /* +0xc */
    unsigned char g1;  /* +0xd */
    unsigned char b1;  /* +0xe */
    unsigned char p1;  /* +0xf */
    short x1;  /* +0x10 */
    short y1;  /* +0x12 */
    unsigned char r2;  /* +0x14 */
    unsigned char g2;  /* +0x15 */
    unsigned char b2;  /* +0x16 */
    unsigned char p2;  /* +0x17 */
    short x2;  /* +0x18 */
    short y2;  /* +0x1a */
    unsigned char r3;  /* +0x1c */
    unsigned char g3;  /* +0x1d */
    unsigned char b3;  /* +0x1e */
    unsigned char p3;  /* +0x1f */
    short x3;  /* +0x20 */
    short y3;  /* +0x22 */
    unsigned long pad;  /* +0x24 */
};

struct MATRIX {  /* size 32 */
    short m[3][3];  /* +0x0 */
    long t[3];  /* +0x14 */
};

enum MEMCARD__180fake {  /* size 4 */
    IMG_BLOOD_STAY = 0,
    IMG_SMOKE = 1,
    IMG_BOMB0 = 2,
    IMG_BOMB1 = 3,
    IMG_BOMB2 = 4,
    IMG_SLASH = 5,
    IMG_GAUGE = 6,
    IMG_ENEMYBAR = 7,
    IMG_ICON_SYURIKEN = 8,
    IMG_ICON_POTIONS = 9,
    IMG_ICON_SMOKE = 10,
    IMG_ICON_FIRE = 11,
    IMG_ICON_MAKIBISHI = 12,
    IMG_ICON_RIKIMARUKO = 13,
    IMG_ICON_KAGINAWA = 14,
    IMG_ICON_HENSHIN = 15,
    IMG_ICON_KAWARIMI = 16,
    IMG_ICON_JIRAI = 17,
    IMG_CURSOR = 18,
    IMG_FONT_NUMBER = 19,
    IMG_KEHAI_GREEN = 20,
    IMG_SIGHT = 21,
    IMG_MISC_FIRE1 = 22,
    IMG_MISC_FIRE2 = 23,
    IMG_MISC_SNOW = 24,
    IMG_SCROLL_WATER = 25,
    IMG_SCROLL_MAGUMA = 26,
    IMG_SCROLL_SEA = 27,
    IMG_ICON_DOKUDANGO = 28,
    IMG_SPLASH = 29,
    IMG_GUNFIRE = 30,
    IMG_FRAME0 = 31,
    IMG_FRAME1 = 32,
    IMG_FRAME2 = 33,
    IMG_FRAME3 = 34,
    IMG_BLOOD_FLY = 35,
    IMG_GUARD = 36,
    IMG_HIT = 37,
    IMG_KEHAI_YELLOW = 38,
    IMG_KEHAI_RED = 39,
    IMG_GOSHIKIMAI = 40,
    IMG_ICON_GOSHIKIMAI = 41,
    IMG_ICON_HAPPOU = 42,
    IMG_ICON_NEMURI = 43,
    IMG_ICON_KAENGEKI = 44,
    IMG_ICON_SHINSOKU = 45,
    IMG_ICON_GOSIN = 46,
    IMG_ICON_MANEBUE = 47,
    IMG_ICON_NINKEN = 48,
    IMG_SCROLL_WARP = 49,
    IMG_LOADING = 50,
    IMG_TENCHU = 51,
    IMG_N = 52,
};

enum MEMCARD__181fake {  /* size 4 */
    MODEL_MON6B = 0,
    MODEL_MON6A = 1,
    MODEL_DOORZ00 = 2,
    MODEL_DOORZ01 = 3,
    MODEL_MON5B = 4,
    MODEL_MON5A = 5,
    MODEL_MONB = 6,
    MODEL_MONA = 7,
    MODEL_MON2B = 8,
    MODEL_MON2A = 9,
    MODEL_MON3B = 10,
    MODEL_MON3A = 11,
    MODEL_MON01 = 12,
    MODEL_MON00 = 13,
    MODEL_GMON01 = 14,
    MODEL_GMON00 = 15,
    MODEL_AKI01 = 16,
    MODEL_AKI00 = 17,
    MODEL_OTO_L = 18,
    MODEL_OTO_R = 19,
    MODEL_SYURIKEN = 20,
    MODEL_ARROW = 21,
    ICON_CARD1 = 22,
    ICON_CARD2 = 23,
    ICON_CARD3 = 24,
    MODEL_SHADOW = 25,
    MODEL_KAGIHEAD = 26,
    MODEL_NINGYO = 27,
    MODEL_HAPPOU = 28,
    MODEL_AKINa = 29,
    MODEL_AKINb = 30,
    MODEL_N = 31,
};

enum MEMCARD__182fake {  /* size 4 */
    MUSIC_STAGE1 = 0,
    MUSIC_STAGE2 = 1,
    MUSIC_STAGE3 = 2,
    MUSIC_STAGE4 = 3,
    MUSIC_STAGE5 = 4,
    MUSIC_STAGE6 = 5,
    MUSIC_STAGE7 = 6,
    MUSIC_STAGE8 = 7,
    MUSIC_STAGE9 = 8,
    MUSIC_GAMEOVER = 9,
    MUSIC_COMPLETE = 10,
    MUSIC_KIKI = 11,
    MUSIC_TITLE = 12,
    MUSIC_CHARA = 13,
    MUSIC_BARMAR = 14,
    MUSIC_MEIOU = 15,
    MUSIC_STAGE_OPEN1 = 16,
    MUSIC_STAGE_OPEN2 = 17,
    MUSIC_STAGE_OPEN3 = 18,
    MUSIC_STAGE_OPEN4 = 19,
    MUSIC_STAGE_OPEN5 = 20,
    MUSIC_STAGE_OPEN6 = 21,
    MUSIC_STAGE_OPEN7 = 22,
    MUSIC_STAGE_OPEN8 = 23,
    MUSIC_STAGE_OPEN7A = 24,
    MUSIC_STAGE_OPEN8A = 25,
    MUSIC_N = 26,
};

enum MEMCARD__191fake {  /* size 4 */
    CDA_ONCE = 0,
    CDA_REPEAT = 1,
};

enum MEMCARD__192fake {  /* size 4 */
    CDA_FLAG_ACTIVE = 1,
};

enum MEMCARD__196fake {  /* size 4 */
    BLOCKSIZE = 8192,
};

enum MISC__164fake {  /* size 4 */
    IMG_BLOOD_STAY = 0,
    IMG_SMOKE = 1,
    IMG_BOMB0 = 2,
    IMG_BOMB1 = 3,
    IMG_BOMB2 = 4,
    IMG_SLASH = 5,
    IMG_GAUGE = 6,
    IMG_ENEMYBAR = 7,
    IMG_ICON_SYURIKEN = 8,
    IMG_ICON_POTIONS = 9,
    IMG_ICON_SMOKE = 10,
    IMG_ICON_FIRE = 11,
    IMG_ICON_MAKIBISHI = 12,
    IMG_ICON_RIKIMARUKO = 13,
    IMG_ICON_KAGINAWA = 14,
    IMG_ICON_HENSHIN = 15,
    IMG_ICON_KAWARIMI = 16,
    IMG_ICON_JIRAI = 17,
    IMG_CURSOR = 18,
    IMG_FONT_NUMBER = 19,
    IMG_KEHAI_GREEN = 20,
    IMG_SIGHT = 21,
    IMG_MISC_FIRE1 = 22,
    IMG_MISC_FIRE2 = 23,
    IMG_MISC_SNOW = 24,
    IMG_SCROLL_WATER = 25,
    IMG_SCROLL_MAGUMA = 26,
    IMG_SCROLL_SEA = 27,
    IMG_ICON_DOKUDANGO = 28,
    IMG_SPLASH = 29,
    IMG_GUNFIRE = 30,
    IMG_FRAME0 = 31,
    IMG_FRAME1 = 32,
    IMG_FRAME2 = 33,
    IMG_FRAME3 = 34,
    IMG_BLOOD_FLY = 35,
    IMG_GUARD = 36,
    IMG_HIT = 37,
    IMG_KEHAI_YELLOW = 38,
    IMG_KEHAI_RED = 39,
    IMG_GOSHIKIMAI = 40,
    IMG_ICON_GOSHIKIMAI = 41,
    IMG_ICON_HAPPOU = 42,
    IMG_ICON_NEMURI = 43,
    IMG_ICON_KAENGEKI = 44,
    IMG_ICON_SHINSOKU = 45,
    IMG_ICON_GOSIN = 46,
    IMG_ICON_MANEBUE = 47,
    IMG_ICON_NINKEN = 48,
    IMG_SCROLL_WARP = 49,
    IMG_LOADING = 50,
    IMG_TENCHU = 51,
    IMG_N = 52,
};

enum MISC__165fake {  /* size 4 */
    MODEL_MON6B = 0,
    MODEL_MON6A = 1,
    MODEL_DOORZ00 = 2,
    MODEL_DOORZ01 = 3,
    MODEL_MON5B = 4,
    MODEL_MON5A = 5,
    MODEL_MONB = 6,
    MODEL_MONA = 7,
    MODEL_MON2B = 8,
    MODEL_MON2A = 9,
    MODEL_MON3B = 10,
    MODEL_MON3A = 11,
    MODEL_MON01 = 12,
    MODEL_MON00 = 13,
    MODEL_GMON01 = 14,
    MODEL_GMON00 = 15,
    MODEL_AKI01 = 16,
    MODEL_AKI00 = 17,
    MODEL_OTO_L = 18,
    MODEL_OTO_R = 19,
    MODEL_SYURIKEN = 20,
    MODEL_ARROW = 21,
    ICON_CARD1 = 22,
    ICON_CARD2 = 23,
    ICON_CARD3 = 24,
    MODEL_SHADOW = 25,
    MODEL_KAGIHEAD = 26,
    MODEL_NINGYO = 27,
    MODEL_HAPPOU = 28,
    MODEL_AKINa = 29,
    MODEL_AKINb = 30,
    MODEL_N = 31,
};

enum MISC__166fake {  /* size 4 */
    MUSIC_STAGE1 = 0,
    MUSIC_STAGE2 = 1,
    MUSIC_STAGE3 = 2,
    MUSIC_STAGE4 = 3,
    MUSIC_STAGE5 = 4,
    MUSIC_STAGE6 = 5,
    MUSIC_STAGE7 = 6,
    MUSIC_STAGE8 = 7,
    MUSIC_STAGE9 = 8,
    MUSIC_GAMEOVER = 9,
    MUSIC_COMPLETE = 10,
    MUSIC_KIKI = 11,
    MUSIC_TITLE = 12,
    MUSIC_CHARA = 13,
    MUSIC_BARMAR = 14,
    MUSIC_MEIOU = 15,
    MUSIC_STAGE_OPEN1 = 16,
    MUSIC_STAGE_OPEN2 = 17,
    MUSIC_STAGE_OPEN3 = 18,
    MUSIC_STAGE_OPEN4 = 19,
    MUSIC_STAGE_OPEN5 = 20,
    MUSIC_STAGE_OPEN6 = 21,
    MUSIC_STAGE_OPEN7 = 22,
    MUSIC_STAGE_OPEN8 = 23,
    MUSIC_STAGE_OPEN7A = 24,
    MUSIC_STAGE_OPEN8A = 25,
    MUSIC_N = 26,
};

struct MISC__180fake {  /* size 12 */
    int a;  /* +0x0 */
    int b;  /* +0x4 */
    int c;  /* +0x8 */
};

union MISC__181fake {  /* size 12 */
    struct MISC__180fake init;  /* +0x0 */
    struct TDoor door;  /* +0x0 */
    struct TPitfall pitfall;  /* +0x0 */
    struct TSnowfall snowfall;  /* +0x0 */
    struct TSprite sprite;  /* +0x0 */
};

enum MISC__182fake {  /* size 4 */
    MaxMisc = 200,
};

struct MISC__183fake {  /* size 12 */
    struct ModelType *Model[2];  /* +0x0 */
    short HitSize;  /* +0x8 */
};

struct MISC__184fake {  /* size 12 */
    struct ModelType *Model[2];  /* +0x0 */
    short HitSize;  /* +0x8 */
};

struct MISC__185fake {  /* size 8 */
    struct Sprite3D *spr;  /* +0x0 */
    long scale;  /* +0x4 */
};

enum MISC__186fake {  /* size 4 */
    MaxSnow = 50,
};

enum MISC__187fake {  /* size 4 */
    LEN = 15000,
};

struct MapVector {  /* size 16 */
    long level;  /* +0x0 */
    long height;  /* +0x4 */
    short attrib;  /* +0x8 */
    short degree;  /* +0xa */
    unsigned char vector;  /* +0xc */
    unsigned char direct;  /* +0xd */
    unsigned char angleL;  /* +0xe */
    unsigned char angleH;  /* +0xf */
};

struct MemoryDiskType {  /* size 32 */
    unsigned char name[24];  /* +0x0 */
    unsigned long size;  /* +0x18 */
    unsigned long *data;  /* +0x1c */
};

enum MiscType {  /* size 4 */
    MISC_FIRE = 0,
    MISC_DOOR = 1,
    MISC_PITFALL = 2,
    MISC_SNOWFALL = 3,
    MISC_SPRITE = 4,
};

struct ModelArchiveType {  /* size 108 */
    struct _GsCOORDINATE2 locate;  /* +0x0 */
    struct SVECTOR rotate;  /* +0x50 */
    short id;  /* +0x58 */
    short attribute;  /* +0x5a */
    struct SVECTOR clip;  /* +0x5c */
    short n;  /* +0x64 */
    struct ModelType **object;  /* +0x68 */
};

struct ModelType {  /* size 116 */
    struct _GsCOORDINATE2 locate;  /* +0x0 */
    struct SVECTOR rotate;  /* +0x50 */
    short id;  /* +0x58 */
    short attribute;  /* +0x5a */
    struct SVECTOR clip;  /* +0x5c */
    struct GsDOBJ2 object;  /* +0x64 */
};

struct MotionDataType {  /* size 16 */
    unsigned char n;  /* +0x0 */
    unsigned char sweep;  /* +0x1 */
    unsigned char orderspd;  /* +0x2 */
    unsigned char sidespd;  /* +0x3 */
    short time;  /* +0x4 */
    short id;  /* +0x6 */
    struct MotionElementType *locate;  /* +0x8 */
    struct MotionElementType *rotate[1];  /* +0xc */
};

struct MotionElementType {  /* size 8 */
    short x;  /* +0x0 */
    short y;  /* +0x2 */
    short z;  /* +0x4 */
    short time;  /* +0x6 */
};

struct MotionManager {  /* size 28 */
    short mid;  /* +0x0 */
    short count;  /* +0x2 */
    short loop;  /* +0x4 */
    short n;  /* +0x6 */
    short mask;  /* +0x8 */
    short mode;  /* +0xa */
    struct ModelArchiveType *model;  /* +0xc */
    struct MotionDataType *motion;  /* +0x10 */
    struct MotionRegistType *motreg;  /* +0x14 */
    struct SplineControlType *control;  /* +0x18 */
};

struct MotionPackType {  /* size 8 */
    long n;  /* +0x0 */
    struct MotionDataType *motion[1];  /* +0x4 */
};

struct MotionRegistType {  /* size 8 */
    short mid;  /* +0x0 */
    short id;  /* +0x2 */
    struct MotionDataType *motion;  /* +0x4 */
};

struct NodeIndexType {  /* size 16 */
    short y;  /* +0x0 */
    short n;  /* +0x2 */
    long index;  /* +0x4 */
    short x1;  /* +0x8 */
    short z1;  /* +0xa */
    short x2;  /* +0xc */
    short z2;  /* +0xe */
};

enum OPAUDIO__7fake {  /* size 4 */
    CDA_ONCE = 0,
    CDA_REPEAT = 1,
};

enum OPAUDIO__8fake {  /* size 4 */
    CDA_FLAG_ACTIVE = 1,
};

enum OPENING__183fake {  /* size 4 */
    CDA_ONCE = 0,
    CDA_REPEAT = 1,
};

enum OPENING__184fake {  /* size 4 */
    CDA_FLAG_ACTIVE = 1,
};

enum OPENING__187fake {  /* size 4 */
    IMG_BLOOD_STAY = 0,
    IMG_SMOKE = 1,
    IMG_BOMB0 = 2,
    IMG_BOMB1 = 3,
    IMG_BOMB2 = 4,
    IMG_SLASH = 5,
    IMG_GAUGE = 6,
    IMG_ENEMYBAR = 7,
    IMG_ICON_SYURIKEN = 8,
    IMG_ICON_POTIONS = 9,
    IMG_ICON_SMOKE = 10,
    IMG_ICON_FIRE = 11,
    IMG_ICON_MAKIBISHI = 12,
    IMG_ICON_RIKIMARUKO = 13,
    IMG_ICON_KAGINAWA = 14,
    IMG_ICON_HENSHIN = 15,
    IMG_ICON_KAWARIMI = 16,
    IMG_ICON_JIRAI = 17,
    IMG_CURSOR = 18,
    IMG_FONT_NUMBER = 19,
    IMG_KEHAI_GREEN = 20,
    IMG_SIGHT = 21,
    IMG_MISC_FIRE1 = 22,
    IMG_MISC_FIRE2 = 23,
    IMG_MISC_SNOW = 24,
    IMG_SCROLL_WATER = 25,
    IMG_SCROLL_MAGUMA = 26,
    IMG_SCROLL_SEA = 27,
    IMG_ICON_DOKUDANGO = 28,
    IMG_SPLASH = 29,
    IMG_GUNFIRE = 30,
    IMG_FRAME0 = 31,
    IMG_FRAME1 = 32,
    IMG_FRAME2 = 33,
    IMG_FRAME3 = 34,
    IMG_BLOOD_FLY = 35,
    IMG_GUARD = 36,
    IMG_HIT = 37,
    IMG_KEHAI_YELLOW = 38,
    IMG_KEHAI_RED = 39,
    IMG_GOSHIKIMAI = 40,
    IMG_ICON_GOSHIKIMAI = 41,
    IMG_ICON_HAPPOU = 42,
    IMG_ICON_NEMURI = 43,
    IMG_ICON_KAENGEKI = 44,
    IMG_ICON_SHINSOKU = 45,
    IMG_ICON_GOSIN = 46,
    IMG_ICON_MANEBUE = 47,
    IMG_ICON_NINKEN = 48,
    IMG_SCROLL_WARP = 49,
    IMG_LOADING = 50,
    IMG_TENCHU = 51,
    IMG_N = 52,
};

enum OPENING__188fake {  /* size 4 */
    MODEL_MON6B = 0,
    MODEL_MON6A = 1,
    MODEL_DOORZ00 = 2,
    MODEL_DOORZ01 = 3,
    MODEL_MON5B = 4,
    MODEL_MON5A = 5,
    MODEL_MONB = 6,
    MODEL_MONA = 7,
    MODEL_MON2B = 8,
    MODEL_MON2A = 9,
    MODEL_MON3B = 10,
    MODEL_MON3A = 11,
    MODEL_MON01 = 12,
    MODEL_MON00 = 13,
    MODEL_GMON01 = 14,
    MODEL_GMON00 = 15,
    MODEL_AKI01 = 16,
    MODEL_AKI00 = 17,
    MODEL_OTO_L = 18,
    MODEL_OTO_R = 19,
    MODEL_SYURIKEN = 20,
    MODEL_ARROW = 21,
    ICON_CARD1 = 22,
    ICON_CARD2 = 23,
    ICON_CARD3 = 24,
    MODEL_SHADOW = 25,
    MODEL_KAGIHEAD = 26,
    MODEL_NINGYO = 27,
    MODEL_HAPPOU = 28,
    MODEL_AKINa = 29,
    MODEL_AKINb = 30,
    MODEL_N = 31,
};

enum OPENING__189fake {  /* size 4 */
    MUSIC_STAGE1 = 0,
    MUSIC_STAGE2 = 1,
    MUSIC_STAGE3 = 2,
    MUSIC_STAGE4 = 3,
    MUSIC_STAGE5 = 4,
    MUSIC_STAGE6 = 5,
    MUSIC_STAGE7 = 6,
    MUSIC_STAGE8 = 7,
    MUSIC_STAGE9 = 8,
    MUSIC_GAMEOVER = 9,
    MUSIC_COMPLETE = 10,
    MUSIC_KIKI = 11,
    MUSIC_TITLE = 12,
    MUSIC_CHARA = 13,
    MUSIC_BARMAR = 14,
    MUSIC_MEIOU = 15,
    MUSIC_STAGE_OPEN1 = 16,
    MUSIC_STAGE_OPEN2 = 17,
    MUSIC_STAGE_OPEN3 = 18,
    MUSIC_STAGE_OPEN4 = 19,
    MUSIC_STAGE_OPEN5 = 20,
    MUSIC_STAGE_OPEN6 = 21,
    MUSIC_STAGE_OPEN7 = 22,
    MUSIC_STAGE_OPEN8 = 23,
    MUSIC_STAGE_OPEN7A = 24,
    MUSIC_STAGE_OPEN8A = 25,
    MUSIC_N = 26,
};

enum OPENING__193fake {  /* size 4 */
    button = 0,
    s_stage1 = 1,
    s_stage2 = 2,
    s_stage3 = 3,
    s_stage4 = 4,
    s_stage5 = 5,
    s_stage6 = 6,
    s_stage7 = 7,
    s_stage8 = 8,
    stg_name = 9,
    sel_stg = 10,
    sel_icon = 11,
};

enum OPENING__194fake {  /* size 4 */
    t_back = 0,
    ritu = 1,
    tai = 2,
    nin = 3,
    jya = 4,
    katu = 5,
    geki = 6,
    kuji2 = 7,
    kuji1 = 8,
    tentit03 = 9,
    tentit02 = 10,
    tentit01 = 11,
    tentit00 = 12,
    sme3 = 13,
    ttl_menu = 14,
};

enum OPENING__195fake {  /* size 4 */
    button_3 = 0,
    p_selttl = 1,
    floor2 = 2,
    p_riki = 3,
    p_aya = 4,
    volligh2 = 5,
};

enum OPENING__196fake {  /* size 4 */
    c_back = 0,
    v_meter = 1,
    settei = 2,
    onryou = 3,
    ongaku = 4,
    memory = 5,
    c_param = 6,
    number = 7,
};

struct ObjectSlotManager {  /* size 12 */
    struct tag_ObjectSlotType *slot;  /* +0x0 */
    int n;  /* +0x4 */
    int max;  /* +0x8 */
};

struct OrnamentArchiveType {  /* size 104 */
    struct _GsCOORDINATE2 locate;  /* +0x0 */
    struct SVECTOR rotate;  /* +0x50 */
    short id;  /* +0x58 */
    short attribute;  /* +0x5a */
    short n;  /* +0x5c */
    struct OrnamentType **object;  /* +0x60 */
    unsigned long *data;  /* +0x64 */
};

struct OrnamentType {  /* size 96 */
    struct _GsCOORDINATE2 locate;  /* +0x0 */
    struct GsDOBJ2 object;  /* +0x50 */
};

struct PADCMD__141fake {  /* size 16 */
    int pow;  /* +0x0 */
    int time;  /* +0x4 */
    int attack;  /* +0x8 */
    int release;  /* +0xc */
};

struct PADtype {  /* size 16 */
    unsigned short data;  /* +0x0 */
    unsigned short sdata;  /* +0x2 */
    unsigned short trig;  /* +0x4 */
    short time;  /* +0x6 */
    unsigned short stream[4];  /* +0x8 */
};

struct PARAM_ITEM_DROP {  /* size 36 */
    enum TItemType type;  /* +0x0 */
    struct VECTOR start;  /* +0x4 */
    struct VECTOR vec;  /* +0x14 */
};

struct PARAM_ITEM_LAUNCH {  /* size 40 */
    enum TItemType type;  /* +0x0 */
    struct Humanoid *user;  /* +0x4 */
    struct VECTOR start;  /* +0x8 */
    struct VECTOR end;  /* +0x18 */
};

struct PARAM_ITEM_STAY {  /* size 20 */
    enum TItemType type;  /* +0x0 */
    struct VECTOR locate;  /* +0x4 */
};

struct POL3 {  /* size 56 */
    short sxy[3][2];  /* +0x0 */
    short sz[3][2];  /* +0xc */
    short uv[3][2];  /* +0x18 */
    short rgb[3][3];  /* +0x24 */
    short code;  /* +0x36 */
};

struct POL4 {  /* size 74 */
    short sxy[4][2];  /* +0x0 */
    short sz[4][2];  /* +0x10 */
    short uv[4][2];  /* +0x20 */
    short rgb[4][3];  /* +0x30 */
    short code;  /* +0x48 */
};

struct POLY_F3 {  /* size 20 */
    unsigned long tag;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    short x0;  /* +0x8 */
    short y0;  /* +0xa */
    short x1;  /* +0xc */
    short y1;  /* +0xe */
    short x2;  /* +0x10 */
    short y2;  /* +0x12 */
};

struct POLY_F4 {  /* size 24 */
    unsigned long tag;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    short x0;  /* +0x8 */
    short y0;  /* +0xa */
    short x1;  /* +0xc */
    short y1;  /* +0xe */
    short x2;  /* +0x10 */
    short y2;  /* +0x12 */
    short x3;  /* +0x14 */
    short y3;  /* +0x16 */
};

struct POLY_FT3 {  /* size 32 */
    unsigned long tag;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    short x0;  /* +0x8 */
    short y0;  /* +0xa */
    unsigned char u0;  /* +0xc */
    unsigned char v0;  /* +0xd */
    unsigned short clut;  /* +0xe */
    short x1;  /* +0x10 */
    short y1;  /* +0x12 */
    unsigned char u1;  /* +0x14 */
    unsigned char v1;  /* +0x15 */
    unsigned short tpage;  /* +0x16 */
    short x2;  /* +0x18 */
    short y2;  /* +0x1a */
    unsigned char u2;  /* +0x1c */
    unsigned char v2;  /* +0x1d */
    unsigned short pad1;  /* +0x1e */
};

struct POLY_FT4 {  /* size 40 */
    unsigned long tag;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    short x0;  /* +0x8 */
    short y0;  /* +0xa */
    unsigned char u0;  /* +0xc */
    unsigned char v0;  /* +0xd */
    unsigned short clut;  /* +0xe */
    short x1;  /* +0x10 */
    short y1;  /* +0x12 */
    unsigned char u1;  /* +0x14 */
    unsigned char v1;  /* +0x15 */
    unsigned short tpage;  /* +0x16 */
    short x2;  /* +0x18 */
    short y2;  /* +0x1a */
    unsigned char u2;  /* +0x1c */
    unsigned char v2;  /* +0x1d */
    unsigned short pad1;  /* +0x1e */
    short x3;  /* +0x20 */
    short y3;  /* +0x22 */
    unsigned char u3;  /* +0x24 */
    unsigned char v3;  /* +0x25 */
    unsigned short pad2;  /* +0x26 */
};

struct POLY_G3 {  /* size 28 */
    unsigned long tag;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    short x0;  /* +0x8 */
    short y0;  /* +0xa */
    unsigned char r1;  /* +0xc */
    unsigned char g1;  /* +0xd */
    unsigned char b1;  /* +0xe */
    unsigned char pad1;  /* +0xf */
    short x1;  /* +0x10 */
    short y1;  /* +0x12 */
    unsigned char r2;  /* +0x14 */
    unsigned char g2;  /* +0x15 */
    unsigned char b2;  /* +0x16 */
    unsigned char pad2;  /* +0x17 */
    short x2;  /* +0x18 */
    short y2;  /* +0x1a */
};

struct POLY_G4 {  /* size 36 */
    unsigned long tag;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    short x0;  /* +0x8 */
    short y0;  /* +0xa */
    unsigned char r1;  /* +0xc */
    unsigned char g1;  /* +0xd */
    unsigned char b1;  /* +0xe */
    unsigned char pad1;  /* +0xf */
    short x1;  /* +0x10 */
    short y1;  /* +0x12 */
    unsigned char r2;  /* +0x14 */
    unsigned char g2;  /* +0x15 */
    unsigned char b2;  /* +0x16 */
    unsigned char pad2;  /* +0x17 */
    short x2;  /* +0x18 */
    short y2;  /* +0x1a */
    unsigned char r3;  /* +0x1c */
    unsigned char g3;  /* +0x1d */
    unsigned char b3;  /* +0x1e */
    unsigned char pad3;  /* +0x1f */
    short x3;  /* +0x20 */
    short y3;  /* +0x22 */
};

struct POLY_GT3 {  /* size 40 */
    unsigned long tag;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    short x0;  /* +0x8 */
    short y0;  /* +0xa */
    unsigned char u0;  /* +0xc */
    unsigned char v0;  /* +0xd */
    unsigned short clut;  /* +0xe */
    unsigned char r1;  /* +0x10 */
    unsigned char g1;  /* +0x11 */
    unsigned char b1;  /* +0x12 */
    unsigned char p1;  /* +0x13 */
    short x1;  /* +0x14 */
    short y1;  /* +0x16 */
    unsigned char u1;  /* +0x18 */
    unsigned char v1;  /* +0x19 */
    unsigned short tpage;  /* +0x1a */
    unsigned char r2;  /* +0x1c */
    unsigned char g2;  /* +0x1d */
    unsigned char b2;  /* +0x1e */
    unsigned char p2;  /* +0x1f */
    short x2;  /* +0x20 */
    short y2;  /* +0x22 */
    unsigned char u2;  /* +0x24 */
    unsigned char v2;  /* +0x25 */
    unsigned short pad2;  /* +0x26 */
};

struct POLY_GT4 {  /* size 52 */
    unsigned long tag;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    short x0;  /* +0x8 */
    short y0;  /* +0xa */
    unsigned char u0;  /* +0xc */
    unsigned char v0;  /* +0xd */
    unsigned short clut;  /* +0xe */
    unsigned char r1;  /* +0x10 */
    unsigned char g1;  /* +0x11 */
    unsigned char b1;  /* +0x12 */
    unsigned char p1;  /* +0x13 */
    short x1;  /* +0x14 */
    short y1;  /* +0x16 */
    unsigned char u1;  /* +0x18 */
    unsigned char v1;  /* +0x19 */
    unsigned short tpage;  /* +0x1a */
    unsigned char r2;  /* +0x1c */
    unsigned char g2;  /* +0x1d */
    unsigned char b2;  /* +0x1e */
    unsigned char p2;  /* +0x1f */
    short x2;  /* +0x20 */
    short y2;  /* +0x22 */
    unsigned char u2;  /* +0x24 */
    unsigned char v2;  /* +0x25 */
    unsigned short pad2;  /* +0x26 */
    unsigned char r3;  /* +0x28 */
    unsigned char g3;  /* +0x29 */
    unsigned char b3;  /* +0x2a */
    unsigned char p3;  /* +0x2b */
    short x3;  /* +0x2c */
    short y3;  /* +0x2e */
    unsigned char u3;  /* +0x30 */
    unsigned char v3;  /* +0x31 */
    unsigned short pad3;  /* +0x32 */
};

struct POLY_XF4 {  /* size 32 */
    struct DR_TPAGE tpage;  /* +0x0 */
    struct POLY_F4 ply;  /* +0x8 */
};

struct POLY_XG4 {  /* size 44 */
    struct DR_TPAGE tpage;  /* +0x0 */
    struct POLY_G4 ply;  /* +0x8 */
};

struct P_CODE {  /* size 4 */
    unsigned char r0;  /* +0x0 */
    unsigned char g0;  /* +0x1 */
    unsigned char b0;  /* +0x2 */
    unsigned char code;  /* +0x3 */
};

struct P_TAG {  /* size 8 */
    unsigned int addr : 24;  /* bit +0 */
    unsigned int len : 8;  /* bit +24 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
};

struct ParentingType {  /* size 16 */
    short np;  /* +0x0 */
    short nc;  /* +0x2 */
    short dx;  /* +0x4 */
    short dy;  /* +0x6 */
    short dz;  /* +0x8 */
    unsigned long index;  /* +0xc */
};

struct ProgAtr {  /* size 16 */
    unsigned char tones;  /* +0x0 */
    unsigned char mvol;  /* +0x1 */
    unsigned char prior;  /* +0x2 */
    unsigned char mode;  /* +0x3 */
    unsigned char mpan;  /* +0x4 */
    unsigned char reserved0;  /* +0x5 */
    short attr;  /* +0x6 */
    unsigned long reserved1;  /* +0x8 */
    unsigned long reserved2;  /* +0xc */
};

struct QMESH {  /* size 24 */
    struct SVECTOR *v;  /* +0x0 */
    struct SVECTOR *n;  /* +0x4 */
    struct SVECTOR *u;  /* +0x8 */
    struct CVECTOR *c;  /* +0xc */
    unsigned long lenv;  /* +0x10 */
    unsigned long lenh;  /* +0x14 */
};

struct RECT {  /* size 8 */
    short x;  /* +0x0 */
    short y;  /* +0x2 */
    short w;  /* +0x4 */
    short h;  /* +0x6 */
};

struct RECT32 {  /* size 16 */
    int x;  /* +0x0 */
    int y;  /* +0x4 */
    int w;  /* +0x8 */
    int h;  /* +0xc */
};

struct RVECTOR {  /* size 24 */
    struct SVECTOR v;  /* +0x0 */
    unsigned char uv[2];  /* +0x8 */
    unsigned short pad;  /* +0xa */
    struct CVECTOR c;  /* +0xc */
    struct DVECTOR sxy;  /* +0x10 */
    unsigned long sz;  /* +0x14 */
};

struct SPOL {  /* size 16 */
    short xy[3];  /* +0x0 */
    short uv[2];  /* +0x6 */
    short rgb[3];  /* +0xa */
};

struct SPRT {  /* size 20 */
    unsigned long tag;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    short x0;  /* +0x8 */
    short y0;  /* +0xa */
    unsigned char u0;  /* +0xc */
    unsigned char v0;  /* +0xd */
    unsigned short clut;  /* +0xe */
    short w;  /* +0x10 */
    short h;  /* +0x12 */
};

struct SPRT_16 {  /* size 16 */
    unsigned long tag;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    short x0;  /* +0x8 */
    short y0;  /* +0xa */
    unsigned char u0;  /* +0xc */
    unsigned char v0;  /* +0xd */
    unsigned short clut;  /* +0xe */
};

struct SPRT_8 {  /* size 16 */
    unsigned long tag;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    short x0;  /* +0x8 */
    short y0;  /* +0xa */
    unsigned char u0;  /* +0xc */
    unsigned char v0;  /* +0xd */
    unsigned short clut;  /* +0xe */
};

enum STAGE__174fake {  /* size 4 */
    CDA_ONCE = 0,
    CDA_REPEAT = 1,
};

enum STAGE__175fake {  /* size 4 */
    CDA_FLAG_ACTIVE = 1,
};

enum STAGE__177fake {  /* size 4 */
    IMG_BLOOD_STAY = 0,
    IMG_SMOKE = 1,
    IMG_BOMB0 = 2,
    IMG_BOMB1 = 3,
    IMG_BOMB2 = 4,
    IMG_SLASH = 5,
    IMG_GAUGE = 6,
    IMG_ENEMYBAR = 7,
    IMG_ICON_SYURIKEN = 8,
    IMG_ICON_POTIONS = 9,
    IMG_ICON_SMOKE = 10,
    IMG_ICON_FIRE = 11,
    IMG_ICON_MAKIBISHI = 12,
    IMG_ICON_RIKIMARUKO = 13,
    IMG_ICON_KAGINAWA = 14,
    IMG_ICON_HENSHIN = 15,
    IMG_ICON_KAWARIMI = 16,
    IMG_ICON_JIRAI = 17,
    IMG_CURSOR = 18,
    IMG_FONT_NUMBER = 19,
    IMG_KEHAI_GREEN = 20,
    IMG_SIGHT = 21,
    IMG_MISC_FIRE1 = 22,
    IMG_MISC_FIRE2 = 23,
    IMG_MISC_SNOW = 24,
    IMG_SCROLL_WATER = 25,
    IMG_SCROLL_MAGUMA = 26,
    IMG_SCROLL_SEA = 27,
    IMG_ICON_DOKUDANGO = 28,
    IMG_SPLASH = 29,
    IMG_GUNFIRE = 30,
    IMG_FRAME0 = 31,
    IMG_FRAME1 = 32,
    IMG_FRAME2 = 33,
    IMG_FRAME3 = 34,
    IMG_BLOOD_FLY = 35,
    IMG_GUARD = 36,
    IMG_HIT = 37,
    IMG_KEHAI_YELLOW = 38,
    IMG_KEHAI_RED = 39,
    IMG_GOSHIKIMAI = 40,
    IMG_ICON_GOSHIKIMAI = 41,
    IMG_ICON_HAPPOU = 42,
    IMG_ICON_NEMURI = 43,
    IMG_ICON_KAENGEKI = 44,
    IMG_ICON_SHINSOKU = 45,
    IMG_ICON_GOSIN = 46,
    IMG_ICON_MANEBUE = 47,
    IMG_ICON_NINKEN = 48,
    IMG_SCROLL_WARP = 49,
    IMG_LOADING = 50,
    IMG_TENCHU = 51,
    IMG_N = 52,
};

enum STAGE__178fake {  /* size 4 */
    MODEL_MON6B = 0,
    MODEL_MON6A = 1,
    MODEL_DOORZ00 = 2,
    MODEL_DOORZ01 = 3,
    MODEL_MON5B = 4,
    MODEL_MON5A = 5,
    MODEL_MONB = 6,
    MODEL_MONA = 7,
    MODEL_MON2B = 8,
    MODEL_MON2A = 9,
    MODEL_MON3B = 10,
    MODEL_MON3A = 11,
    MODEL_MON01 = 12,
    MODEL_MON00 = 13,
    MODEL_GMON01 = 14,
    MODEL_GMON00 = 15,
    MODEL_AKI01 = 16,
    MODEL_AKI00 = 17,
    MODEL_OTO_L = 18,
    MODEL_OTO_R = 19,
    MODEL_SYURIKEN = 20,
    MODEL_ARROW = 21,
    ICON_CARD1 = 22,
    ICON_CARD2 = 23,
    ICON_CARD3 = 24,
    MODEL_SHADOW = 25,
    MODEL_KAGIHEAD = 26,
    MODEL_NINGYO = 27,
    MODEL_HAPPOU = 28,
    MODEL_AKINa = 29,
    MODEL_AKINb = 30,
    MODEL_N = 31,
};

enum STAGE__179fake {  /* size 4 */
    MUSIC_STAGE1 = 0,
    MUSIC_STAGE2 = 1,
    MUSIC_STAGE3 = 2,
    MUSIC_STAGE4 = 3,
    MUSIC_STAGE5 = 4,
    MUSIC_STAGE6 = 5,
    MUSIC_STAGE7 = 6,
    MUSIC_STAGE8 = 7,
    MUSIC_STAGE9 = 8,
    MUSIC_GAMEOVER = 9,
    MUSIC_COMPLETE = 10,
    MUSIC_KIKI = 11,
    MUSIC_TITLE = 12,
    MUSIC_CHARA = 13,
    MUSIC_BARMAR = 14,
    MUSIC_MEIOU = 15,
    MUSIC_STAGE_OPEN1 = 16,
    MUSIC_STAGE_OPEN2 = 17,
    MUSIC_STAGE_OPEN3 = 18,
    MUSIC_STAGE_OPEN4 = 19,
    MUSIC_STAGE_OPEN5 = 20,
    MUSIC_STAGE_OPEN6 = 21,
    MUSIC_STAGE_OPEN7 = 22,
    MUSIC_STAGE_OPEN8 = 23,
    MUSIC_STAGE_OPEN7A = 24,
    MUSIC_STAGE_OPEN8A = 25,
    MUSIC_N = 26,
};

enum START__180fake {  /* size 4 */
    CDA_ONCE = 0,
    CDA_REPEAT = 1,
};

enum START__181fake {  /* size 4 */
    CDA_FLAG_ACTIVE = 1,
};

enum START__183fake {  /* size 4 */
    IMG_BLOOD_STAY = 0,
    IMG_SMOKE = 1,
    IMG_BOMB0 = 2,
    IMG_BOMB1 = 3,
    IMG_BOMB2 = 4,
    IMG_SLASH = 5,
    IMG_GAUGE = 6,
    IMG_ENEMYBAR = 7,
    IMG_ICON_SYURIKEN = 8,
    IMG_ICON_POTIONS = 9,
    IMG_ICON_SMOKE = 10,
    IMG_ICON_FIRE = 11,
    IMG_ICON_MAKIBISHI = 12,
    IMG_ICON_RIKIMARUKO = 13,
    IMG_ICON_KAGINAWA = 14,
    IMG_ICON_HENSHIN = 15,
    IMG_ICON_KAWARIMI = 16,
    IMG_ICON_JIRAI = 17,
    IMG_CURSOR = 18,
    IMG_FONT_NUMBER = 19,
    IMG_KEHAI_GREEN = 20,
    IMG_SIGHT = 21,
    IMG_MISC_FIRE1 = 22,
    IMG_MISC_FIRE2 = 23,
    IMG_MISC_SNOW = 24,
    IMG_SCROLL_WATER = 25,
    IMG_SCROLL_MAGUMA = 26,
    IMG_SCROLL_SEA = 27,
    IMG_ICON_DOKUDANGO = 28,
    IMG_SPLASH = 29,
    IMG_GUNFIRE = 30,
    IMG_FRAME0 = 31,
    IMG_FRAME1 = 32,
    IMG_FRAME2 = 33,
    IMG_FRAME3 = 34,
    IMG_BLOOD_FLY = 35,
    IMG_GUARD = 36,
    IMG_HIT = 37,
    IMG_KEHAI_YELLOW = 38,
    IMG_KEHAI_RED = 39,
    IMG_GOSHIKIMAI = 40,
    IMG_ICON_GOSHIKIMAI = 41,
    IMG_ICON_HAPPOU = 42,
    IMG_ICON_NEMURI = 43,
    IMG_ICON_KAENGEKI = 44,
    IMG_ICON_SHINSOKU = 45,
    IMG_ICON_GOSIN = 46,
    IMG_ICON_MANEBUE = 47,
    IMG_ICON_NINKEN = 48,
    IMG_SCROLL_WARP = 49,
    IMG_LOADING = 50,
    IMG_TENCHU = 51,
    IMG_N = 52,
};

enum START__184fake {  /* size 4 */
    MODEL_MON6B = 0,
    MODEL_MON6A = 1,
    MODEL_DOORZ00 = 2,
    MODEL_DOORZ01 = 3,
    MODEL_MON5B = 4,
    MODEL_MON5A = 5,
    MODEL_MONB = 6,
    MODEL_MONA = 7,
    MODEL_MON2B = 8,
    MODEL_MON2A = 9,
    MODEL_MON3B = 10,
    MODEL_MON3A = 11,
    MODEL_MON01 = 12,
    MODEL_MON00 = 13,
    MODEL_GMON01 = 14,
    MODEL_GMON00 = 15,
    MODEL_AKI01 = 16,
    MODEL_AKI00 = 17,
    MODEL_OTO_L = 18,
    MODEL_OTO_R = 19,
    MODEL_SYURIKEN = 20,
    MODEL_ARROW = 21,
    ICON_CARD1 = 22,
    ICON_CARD2 = 23,
    ICON_CARD3 = 24,
    MODEL_SHADOW = 25,
    MODEL_KAGIHEAD = 26,
    MODEL_NINGYO = 27,
    MODEL_HAPPOU = 28,
    MODEL_AKINa = 29,
    MODEL_AKINb = 30,
    MODEL_N = 31,
};

enum START__185fake {  /* size 4 */
    MUSIC_STAGE1 = 0,
    MUSIC_STAGE2 = 1,
    MUSIC_STAGE3 = 2,
    MUSIC_STAGE4 = 3,
    MUSIC_STAGE5 = 4,
    MUSIC_STAGE6 = 5,
    MUSIC_STAGE7 = 6,
    MUSIC_STAGE8 = 7,
    MUSIC_STAGE9 = 8,
    MUSIC_GAMEOVER = 9,
    MUSIC_COMPLETE = 10,
    MUSIC_KIKI = 11,
    MUSIC_TITLE = 12,
    MUSIC_CHARA = 13,
    MUSIC_BARMAR = 14,
    MUSIC_MEIOU = 15,
    MUSIC_STAGE_OPEN1 = 16,
    MUSIC_STAGE_OPEN2 = 17,
    MUSIC_STAGE_OPEN3 = 18,
    MUSIC_STAGE_OPEN4 = 19,
    MUSIC_STAGE_OPEN5 = 20,
    MUSIC_STAGE_OPEN6 = 21,
    MUSIC_STAGE_OPEN7 = 22,
    MUSIC_STAGE_OPEN8 = 23,
    MUSIC_STAGE_OPEN7A = 24,
    MUSIC_STAGE_OPEN8A = 25,
    MUSIC_N = 26,
};

struct SVECTOR {  /* size 8 */
    short vx;  /* +0x0 */
    short vy;  /* +0x2 */
    short vz;  /* +0x4 */
    short pad;  /* +0x6 */
};

struct SmokeType {  /* size 36 */
    struct SVECTOR vec;  /* +0x0 */
    struct VECTOR pos;  /* +0x8 */
    long rotate;  /* +0x18 */
    long scale;  /* +0x1c */
    unsigned char time;  /* +0x20 */
    unsigned char evtime;  /* +0x21 */
};

struct SndRegisterAttr {  /* size 14 */
    struct SndVolume2 volume;  /* +0x0 */
    short pitch;  /* +0x4 */
    short mask;  /* +0x6 */
    short addr;  /* +0x8 */
    short adsr1;  /* +0xa */
    short adsr2;  /* +0xc */
};

struct SndVoiceStats {  /* size 18 */
    short vagId;  /* +0x0 */
    short vabId;  /* +0x2 */
    unsigned short pitch;  /* +0x4 */
    short note;  /* +0x6 */
    short tone;  /* +0x8 */
    short prog_num;  /* +0xa */
    short prog_actual;  /* +0xc */
    short vol;  /* +0xe */
    short pan;  /* +0x10 */
};

struct SndVolume {  /* size 4 */
    unsigned short left;  /* +0x0 */
    unsigned short right;  /* +0x2 */
};

struct SndVolume2 {  /* size 4 */
    short left;  /* +0x0 */
    short right;  /* +0x2 */
};

struct SoundEffect {  /* size 8 */
    short VABid;  /* +0x0 */
    short program;  /* +0x2 */
    struct VabHdr *VABhead;  /* +0x4 */
};

struct SplashType {  /* size 20 */
    long px;  /* +0x0 */
    long py;  /* +0x4 */
    long pz;  /* +0x8 */
    short sx;  /* +0xc */
    short sy;  /* +0xe */
    unsigned char speed;  /* +0x10 */
    unsigned char count;  /* +0x11 */
    unsigned char mode;  /* +0x12 */
};

struct SplineControlType {  /* size 24 */
    struct MotionElementType *key0;  /* +0x0 */
    struct MotionElementType *key1;  /* +0x4 */
    struct SVECTOR dd0;  /* +0x8 */
    struct SVECTOR ds1;  /* +0x10 */
};

struct Sprite3D {  /* size 140 */
    struct _GsCOORDINATE2 locate;  /* +0x0 */
    struct SVECTOR rotate;  /* +0x50 */
    short id;  /* +0x58 */
    short attribute;  /* +0x5a */
    struct SVECTOR clip;  /* +0x5c */
    long scale;  /* +0x64 */
    struct GsSPRITE sprite;  /* +0x68 */
};

struct StHEADER {  /* size 32 */
    unsigned short id;  /* +0x0 */
    unsigned short type;  /* +0x2 */
    unsigned short secCount;  /* +0x4 */
    unsigned short nSectors;  /* +0x6 */
    unsigned long frameCount;  /* +0x8 */
    unsigned long frameSize;  /* +0xc */
    unsigned short width;  /* +0x10 */
    unsigned short height;  /* +0x12 */
    unsigned long dummy1;  /* +0x14 */
    unsigned long dummy2;  /* +0x18 */
    struct CdlLOC loc;  /* +0x1c */
};

struct StageCharType {  /* size 14 */
    short stage;  /* +0x0 */
    short chrid;  /* +0x2 */
    struct SVECTOR position;  /* +0x4 */
    short think;  /* +0xc */
};

struct TAFS {  /* size 28 */
    struct TFileHandle *fpVol;  /* +0x0 */
    int fModified;  /* +0x4 */
    unsigned long posElement;  /* +0x8 */
    struct TAFSElement *pElement;  /* +0xc */
    unsigned long maxElements;  /* +0x10 */
    int maxElementArea;  /* +0x14 */
    struct TAFSFileHandle *pHandle;  /* +0x18 */
};

struct TAFSElement {  /* size 36 */
    unsigned short flag;  /* +0x0 */
    unsigned long pos;  /* +0x4 */
    unsigned long size;  /* +0x8 */
    unsigned long psize;  /* +0xc */
    unsigned char name[20];  /* +0x10 */
};

struct TAFSFileHandle {  /* size 12 */
    int flagUse;  /* +0x0 */
    unsigned long pos;  /* +0x4 */
    struct TAFSElement *info;  /* +0x8 */
};

struct TAdtDisp {  /* size 32912 */
    struct DRAWENV draw;  /* +0x0 */
    struct DISPENV disp;  /* +0x5c */
    struct RECT rect;  /* +0x70 */
    unsigned char backup[32768];  /* +0x78 */
    struct POLY_F4 bg;  /* +0x8078 */
};

struct TAdtSelect {  /* size 8 */
    unsigned char *name;  /* +0x0 */
    unsigned long value;  /* +0x4 */
};

struct TCB {  /* size 192 */
    long status;  /* +0x0 */
    long mode;  /* +0x4 */
    unsigned long reg[40];  /* +0x8 */
    long system[6];  /* +0xa8 */
};

struct TCBH {  /* size 8 */
    struct TCB *entry;  /* +0x0 */
    long flag;  /* +0x4 */
};

enum TCameraMode {  /* size 4 */
    CMODE_NORMAL = 0,
    CMODE_DIRECTION = 1,
    CMODE_SYSPARAM = 2,
    CMODE_SIGHT = 3,
    CMODE_CRITICAL_HIT = 4,
    CMODE_FIGHT = 5,
    CMODE_STICK_L = 6,
    CMODE_STICK_R = 7,
    CMODE_SWIM = 8,
    CMODE_PEEP_L = 9,
    CMODE_PEEP_R = 10,
    CMODE_CROUCH = 11,
    CMODE_RUN = 12,
    CMODE_LOCK = 13,
    CMODE_FALL = 14,
};

struct TCameraPos {  /* size 16 */
    struct SVECTOR pos;  /* +0x0 */
    struct SVECTOR ref;  /* +0x8 */
};

struct TCameraStatus {  /* size 36 */
    struct VECTOR TargetVector;  /* +0x0 */
    struct Humanoid *Owner;  /* +0x10 */
    enum TCameraMode Mode;  /* +0x14 */
    enum TCameraMode OldMode;  /* +0x18 */
    short DirectionRX;  /* +0x1c */
    short DirectionRY;  /* +0x1e */
    unsigned char Valiation;  /* +0x20 */
};

struct TCardHeader {  /* size 512 */
    unsigned char Magic[2];  /* +0x0 */
    unsigned char Type;  /* +0x2 */
    unsigned char BlockEntry;  /* +0x3 */
    unsigned char Title[64];  /* +0x4 */
    unsigned char reserve[28];  /* +0x44 */
    unsigned char Clut[32];  /* +0x60 */
    unsigned char Icon[3][128];  /* +0x80 */
};

struct TCdaStatus {  /* size 20 */
    int StartPos;  /* +0x0 */
    int CurPos;  /* +0x4 */
    int EndPos;  /* +0x8 */
    short mode;  /* +0xc */
    short flag;  /* +0xe */
    short CheckCount;  /* +0x10 */
    unsigned char status;  /* +0x12 */
};

struct TDoor {  /* size 12 */
    struct ModelType *locate;  /* +0x0 */
    short r;  /* +0x4 */
    short dr;  /* +0x6 */
    unsigned char type;  /* +0x8 */
};

struct TEnemyLayout {  /* size 136 */
    short type;  /* +0x0 */
    short ThinkType;  /* +0x2 */
    short nPath;  /* +0x4 */
    long x;  /* +0x8 */
    long y;  /* +0xc */
    long z;  /* +0x10 */
    short r;  /* +0x14 */
    short pad;  /* +0x16 */
    struct VECTOR path[7];  /* +0x18 */
};

struct TFileHandle {  /* size 32 */
    struct CdlFILE finfo;  /* +0x0 */
    int flagUse;  /* +0x18 */
    long pos;  /* +0x1c */
};

struct TFindItemTarget {  /* size 32 */
    struct Humanoid *find;  /* +0x0 */
    int dist;  /* +0x4 */
    int i;  /* +0x8 */
    struct VECTOR pos;  /* +0xc */
    int find_dist;  /* +0x1c */
};

struct TILE {  /* size 16 */
    unsigned long tag;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    short x0;  /* +0x8 */
    short y0;  /* +0xa */
    short w;  /* +0xc */
    short h;  /* +0xe */
};

struct TILE_1 {  /* size 12 */
    unsigned long tag;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    short x0;  /* +0x8 */
    short y0;  /* +0xa */
};

struct TILE_16 {  /* size 12 */
    unsigned long tag;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    short x0;  /* +0x8 */
    short y0;  /* +0xa */
};

struct TILE_8 {  /* size 12 */
    unsigned long tag;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    short x0;  /* +0x8 */
    short y0;  /* +0xa */
};

struct TIM_IMAGE {  /* size 20 */
    unsigned long mode;  /* +0x0 */
    struct RECT *crect;  /* +0x4 */
    unsigned long *caddr;  /* +0x8 */
    struct RECT *prect;  /* +0xc */
    unsigned long *paddr;  /* +0x10 */
};

struct TItemLayout {  /* size 20 */
    int type;  /* +0x0 */
    struct VECTOR locate;  /* +0x4 */
};

enum TItemType {  /* size 4 */
    ITEM_KAGINAWA = 0,
    ITEM_SHURIKEN = 1,
    ITEM_MAKIBISHI = 2,
    ITEM_KUSURI = 3,
    ITEM_FIRE = 4,
    ITEM_SMOKE = 5,
    ITEM_JIRAI = 6,
    ITEM_DOKUDANGO = 7,
    ITEM_NEMURI = 8,
    ITEM_GOSHIKIMAI = 9,
    ITEM_KAWARIMI = 10,
    ITEM_HENSHIN = 11,
    ITEM_GOSIN = 12,
    ITEM_SHINSOKU = 13,
    ITEM_NINGYO = 14,
    ITEM_HAPPOU = 15,
    ITEM_NINKEN = 16,
    ITEM_KAENGEKI = 17,
    ITEM_MANEBUE = 18,
    ITEM_GUN = 19,
    ITEM_ARROW = 20,
    ITEM_NAPALM = 21,
    ITEM_LIGHTNINGBOLT = 22,
    ITEM_TELEPORT = 23,
    ITEM_SYSFLAG = 24,
    ITEM_N = 25,
};

struct TLinkInfo {  /* size 216 */
    short CharType;  /* +0x0 */
    unsigned char StageNo;  /* +0x2 */
    unsigned char StageNoMAX[2];  /* +0x3 */
    unsigned char Nannido;  /* +0x5 */
    unsigned char ZangyakuOff;  /* +0x6 */
    unsigned char Stereo;  /* +0x7 */
    unsigned char SoundLevel;  /* +0x8 */
    unsigned char SELevel;  /* +0x9 */
    unsigned char bufSoundLevel;  /* +0xa */
    unsigned char bufSELevel;  /* +0xb */
    unsigned char fMemory;  /* +0xc */
    unsigned char GameRetry;  /* +0xd */
    unsigned char Anakon;  /* +0xe */
    unsigned char gItem[30];  /* +0xf */
    unsigned char selItem[30];  /* +0x2d */
    unsigned char saveItem[30];  /* +0x4b */
    short gHitusatu[9];  /* +0x6a */
    short gKanryou[9];  /* +0x7c */
    short gDani[9];  /* +0x8e */
    short gSennyuu[9];  /* +0xa0 */
    unsigned char gSitome[9];  /* +0xb2 */
    unsigned char gZangyaku[9];  /* +0xbb */
    unsigned char t_dani[5];  /* +0xc4 */
    unsigned char t_char[5];  /* +0xc9 */
    unsigned char t_fun[5];  /* +0xce */
    unsigned char t_byou[5];  /* +0xd3 */
};

struct TMD_PRIM {  /* size 120 */
    unsigned long id;  /* +0x0 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char p0;  /* +0x7 */
    unsigned char r1;  /* +0x8 */
    unsigned char g1;  /* +0x9 */
    unsigned char b1;  /* +0xa */
    unsigned char p1;  /* +0xb */
    unsigned char r2;  /* +0xc */
    unsigned char g2;  /* +0xd */
    unsigned char b2;  /* +0xe */
    unsigned char p2;  /* +0xf */
    unsigned char r3;  /* +0x10 */
    unsigned char g3;  /* +0x11 */
    unsigned char b3;  /* +0x12 */
    unsigned char p3;  /* +0x13 */
    unsigned short tpage;  /* +0x14 */
    unsigned short clut;  /* +0x16 */
    unsigned char u0;  /* +0x18 */
    unsigned char v0;  /* +0x19 */
    unsigned char u1;  /* +0x1a */
    unsigned char v1;  /* +0x1b */
    unsigned char u2;  /* +0x1c */
    unsigned char v2;  /* +0x1d */
    unsigned char u3;  /* +0x1e */
    unsigned char v3;  /* +0x1f */
    struct SVECTOR x0;  /* +0x20 */
    struct SVECTOR x1;  /* +0x28 */
    struct SVECTOR x2;  /* +0x30 */
    struct SVECTOR x3;  /* +0x38 */
    struct SVECTOR n0;  /* +0x40 */
    struct SVECTOR n1;  /* +0x48 */
    struct SVECTOR n2;  /* +0x50 */
    struct SVECTOR n3;  /* +0x58 */
    struct SVECTOR *v_ofs;  /* +0x60 */
    struct SVECTOR *n_ofs;  /* +0x64 */
    unsigned short vert0;  /* +0x68 */
    unsigned short vert1;  /* +0x6a */
    unsigned short vert2;  /* +0x6c */
    unsigned short vert3;  /* +0x6e */
    unsigned short norm0;  /* +0x70 */
    unsigned short norm1;  /* +0x72 */
    unsigned short norm2;  /* +0x74 */
    unsigned short norm3;  /* +0x76 */
};

struct TMD_P_F3 {  /* size 16 */
    unsigned char out;  /* +0x0 */
    unsigned char in;  /* +0x1 */
    unsigned char dummy;  /* +0x2 */
    unsigned char cd;  /* +0x3 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    unsigned short n0;  /* +0x8 */
    unsigned short v0;  /* +0xa */
    unsigned short v1;  /* +0xc */
    unsigned short v2;  /* +0xe */
};

struct TMD_P_F3G {  /* size 24 */
    unsigned char out;  /* +0x0 */
    unsigned char in;  /* +0x1 */
    unsigned char dummy;  /* +0x2 */
    unsigned char cd;  /* +0x3 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    unsigned char r1;  /* +0x8 */
    unsigned char g1;  /* +0x9 */
    unsigned char b1;  /* +0xa */
    unsigned char dummy1;  /* +0xb */
    unsigned char r2;  /* +0xc */
    unsigned char g2;  /* +0xd */
    unsigned char b2;  /* +0xe */
    unsigned char dummy2;  /* +0xf */
    unsigned short n0;  /* +0x10 */
    unsigned short v0;  /* +0x12 */
    unsigned short v1;  /* +0x14 */
    unsigned short v2;  /* +0x16 */
};

struct TMD_P_F4 {  /* size 20 */
    unsigned char out;  /* +0x0 */
    unsigned char in;  /* +0x1 */
    unsigned char dummy;  /* +0x2 */
    unsigned char cd;  /* +0x3 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    unsigned short n0;  /* +0x8 */
    unsigned short v0;  /* +0xa */
    unsigned short v1;  /* +0xc */
    unsigned short v2;  /* +0xe */
    unsigned short v3;  /* +0x10 */
    unsigned short p;  /* +0x12 */
};

struct TMD_P_F4G {  /* size 32 */
    unsigned char out;  /* +0x0 */
    unsigned char in;  /* +0x1 */
    unsigned char dummy;  /* +0x2 */
    unsigned char cd;  /* +0x3 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    unsigned char r1;  /* +0x8 */
    unsigned char g1;  /* +0x9 */
    unsigned char b1;  /* +0xa */
    unsigned char dummy1;  /* +0xb */
    unsigned char r2;  /* +0xc */
    unsigned char g2;  /* +0xd */
    unsigned char b2;  /* +0xe */
    unsigned char dummy2;  /* +0xf */
    unsigned char r3;  /* +0x10 */
    unsigned char g3;  /* +0x11 */
    unsigned char b3;  /* +0x12 */
    unsigned char dummy3;  /* +0x13 */
    unsigned short n0;  /* +0x14 */
    unsigned short v0;  /* +0x16 */
    unsigned short v1;  /* +0x18 */
    unsigned short v2;  /* +0x1a */
    unsigned short v3;  /* +0x1c */
    unsigned short dummy4;  /* +0x1e */
};

struct TMD_P_G3 {  /* size 20 */
    unsigned char out;  /* +0x0 */
    unsigned char in;  /* +0x1 */
    unsigned char dummy;  /* +0x2 */
    unsigned char cd;  /* +0x3 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    unsigned short n0;  /* +0x8 */
    unsigned short v0;  /* +0xa */
    unsigned short n1;  /* +0xc */
    unsigned short v1;  /* +0xe */
    unsigned short n2;  /* +0x10 */
    unsigned short v2;  /* +0x12 */
};

struct TMD_P_G3G {  /* size 28 */
    unsigned char out;  /* +0x0 */
    unsigned char in;  /* +0x1 */
    unsigned char dummy;  /* +0x2 */
    unsigned char cd;  /* +0x3 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    unsigned char r1;  /* +0x8 */
    unsigned char g1;  /* +0x9 */
    unsigned char b1;  /* +0xa */
    unsigned char dummy1;  /* +0xb */
    unsigned char r2;  /* +0xc */
    unsigned char g2;  /* +0xd */
    unsigned char b2;  /* +0xe */
    unsigned char dummy2;  /* +0xf */
    unsigned short n0;  /* +0x10 */
    unsigned short v0;  /* +0x12 */
    unsigned short n1;  /* +0x14 */
    unsigned short v1;  /* +0x16 */
    unsigned short n2;  /* +0x18 */
    unsigned short v2;  /* +0x1a */
};

struct TMD_P_G4 {  /* size 24 */
    unsigned char out;  /* +0x0 */
    unsigned char in;  /* +0x1 */
    unsigned char dummy;  /* +0x2 */
    unsigned char cd;  /* +0x3 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    unsigned short n0;  /* +0x8 */
    unsigned short v0;  /* +0xa */
    unsigned short n1;  /* +0xc */
    unsigned short v1;  /* +0xe */
    unsigned short n2;  /* +0x10 */
    unsigned short v2;  /* +0x12 */
    unsigned short n3;  /* +0x14 */
    unsigned short v3;  /* +0x16 */
};

struct TMD_P_G4G {  /* size 36 */
    unsigned char out;  /* +0x0 */
    unsigned char in;  /* +0x1 */
    unsigned char dummy;  /* +0x2 */
    unsigned char cd;  /* +0x3 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    unsigned char r1;  /* +0x8 */
    unsigned char g1;  /* +0x9 */
    unsigned char b1;  /* +0xa */
    unsigned char dummy1;  /* +0xb */
    unsigned char r2;  /* +0xc */
    unsigned char g2;  /* +0xd */
    unsigned char b2;  /* +0xe */
    unsigned char dummy2;  /* +0xf */
    unsigned char r3;  /* +0x10 */
    unsigned char g3;  /* +0x11 */
    unsigned char b3;  /* +0x12 */
    unsigned char dummy3;  /* +0x13 */
    unsigned short n0;  /* +0x14 */
    unsigned short v0;  /* +0x16 */
    unsigned short n1;  /* +0x18 */
    unsigned short v1;  /* +0x1a */
    unsigned short n2;  /* +0x1c */
    unsigned short v2;  /* +0x1e */
    unsigned short n3;  /* +0x20 */
    unsigned short v3;  /* +0x22 */
};

struct TMD_P_NF3 {  /* size 16 */
    unsigned char out;  /* +0x0 */
    unsigned char in;  /* +0x1 */
    unsigned char dummy;  /* +0x2 */
    unsigned char cd;  /* +0x3 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    unsigned short v0;  /* +0x8 */
    unsigned short v1;  /* +0xa */
    unsigned short v2;  /* +0xc */
    unsigned short p;  /* +0xe */
};

struct TMD_P_NF4 {  /* size 16 */
    unsigned char out;  /* +0x0 */
    unsigned char in;  /* +0x1 */
    unsigned char dummy;  /* +0x2 */
    unsigned char cd;  /* +0x3 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    unsigned short v0;  /* +0x8 */
    unsigned short v1;  /* +0xa */
    unsigned short v2;  /* +0xc */
    unsigned short v3;  /* +0xe */
};

struct TMD_P_NG3 {  /* size 24 */
    unsigned char out;  /* +0x0 */
    unsigned char in;  /* +0x1 */
    unsigned char dummy;  /* +0x2 */
    unsigned char cd;  /* +0x3 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    unsigned char r1;  /* +0x8 */
    unsigned char g1;  /* +0x9 */
    unsigned char b1;  /* +0xa */
    unsigned char p1;  /* +0xb */
    unsigned char r2;  /* +0xc */
    unsigned char g2;  /* +0xd */
    unsigned char b2;  /* +0xe */
    unsigned char p2;  /* +0xf */
    unsigned short v0;  /* +0x10 */
    unsigned short v1;  /* +0x12 */
    unsigned short v2;  /* +0x14 */
    unsigned short p;  /* +0x16 */
};

struct TMD_P_NG4 {  /* size 28 */
    unsigned char out;  /* +0x0 */
    unsigned char in;  /* +0x1 */
    unsigned char dummy;  /* +0x2 */
    unsigned char cd;  /* +0x3 */
    unsigned char r0;  /* +0x4 */
    unsigned char g0;  /* +0x5 */
    unsigned char b0;  /* +0x6 */
    unsigned char code;  /* +0x7 */
    unsigned char r1;  /* +0x8 */
    unsigned char g1;  /* +0x9 */
    unsigned char b1;  /* +0xa */
    unsigned char p1;  /* +0xb */
    unsigned char r2;  /* +0xc */
    unsigned char g2;  /* +0xd */
    unsigned char b2;  /* +0xe */
    unsigned char p2;  /* +0xf */
    unsigned char r3;  /* +0x10 */
    unsigned char g3;  /* +0x11 */
    unsigned char b3;  /* +0x12 */
    unsigned char p3;  /* +0x13 */
    unsigned short v0;  /* +0x14 */
    unsigned short v1;  /* +0x16 */
    unsigned short v2;  /* +0x18 */
    unsigned short v3;  /* +0x1a */
};

struct TMD_P_TF3 {  /* size 24 */
    unsigned char out;  /* +0x0 */
    unsigned char in;  /* +0x1 */
    unsigned char dummy;  /* +0x2 */
    unsigned char cd;  /* +0x3 */
    unsigned char tu0;  /* +0x4 */
    unsigned char tv0;  /* +0x5 */
    unsigned short clut;  /* +0x6 */
    unsigned char tu1;  /* +0x8 */
    unsigned char tv1;  /* +0x9 */
    unsigned short tpage;  /* +0xa */
    unsigned char tu2;  /* +0xc */
    unsigned char tv2;  /* +0xd */
    unsigned short p;  /* +0xe */
    unsigned short n0;  /* +0x10 */
    unsigned short v0;  /* +0x12 */
    unsigned short v1;  /* +0x14 */
    unsigned short v2;  /* +0x16 */
};

struct TMD_P_TF4 {  /* size 32 */
    unsigned char out;  /* +0x0 */
    unsigned char in;  /* +0x1 */
    unsigned char dummy;  /* +0x2 */
    unsigned char cd;  /* +0x3 */
    unsigned char tu0;  /* +0x4 */
    unsigned char tv0;  /* +0x5 */
    unsigned short clut;  /* +0x6 */
    unsigned char tu1;  /* +0x8 */
    unsigned char tv1;  /* +0x9 */
    unsigned short tpage;  /* +0xa */
    unsigned char tu2;  /* +0xc */
    unsigned char tv2;  /* +0xd */
    unsigned short p0;  /* +0xe */
    unsigned char tu3;  /* +0x10 */
    unsigned char tv3;  /* +0x11 */
    unsigned short p1;  /* +0x12 */
    unsigned short n0;  /* +0x14 */
    unsigned short v0;  /* +0x16 */
    unsigned short v1;  /* +0x18 */
    unsigned short v2;  /* +0x1a */
    unsigned short v3;  /* +0x1c */
    unsigned short p2;  /* +0x1e */
};

struct TMD_P_TG3 {  /* size 28 */
    unsigned char out;  /* +0x0 */
    unsigned char in;  /* +0x1 */
    unsigned char dummy;  /* +0x2 */
    unsigned char cd;  /* +0x3 */
    unsigned char tu0;  /* +0x4 */
    unsigned char tv0;  /* +0x5 */
    unsigned short clut;  /* +0x6 */
    unsigned char tu1;  /* +0x8 */
    unsigned char tv1;  /* +0x9 */
    unsigned short tpage;  /* +0xa */
    unsigned char tu2;  /* +0xc */
    unsigned char tv2;  /* +0xd */
    unsigned short p;  /* +0xe */
    unsigned short n0;  /* +0x10 */
    unsigned short v0;  /* +0x12 */
    unsigned short n1;  /* +0x14 */
    unsigned short v1;  /* +0x16 */
    unsigned short n2;  /* +0x18 */
    unsigned short v2;  /* +0x1a */
};

struct TMD_P_TG4 {  /* size 36 */
    unsigned char out;  /* +0x0 */
    unsigned char in;  /* +0x1 */
    unsigned char dummy;  /* +0x2 */
    unsigned char cd;  /* +0x3 */
    unsigned char tu0;  /* +0x4 */
    unsigned char tv0;  /* +0x5 */
    unsigned short clut;  /* +0x6 */
    unsigned char tu1;  /* +0x8 */
    unsigned char tv1;  /* +0x9 */
    unsigned short tpage;  /* +0xa */
    unsigned char tu2;  /* +0xc */
    unsigned char tv2;  /* +0xd */
    unsigned short p0;  /* +0xe */
    unsigned char tu3;  /* +0x10 */
    unsigned char tv3;  /* +0x11 */
    unsigned short p1;  /* +0x12 */
    unsigned short n0;  /* +0x14 */
    unsigned short v0;  /* +0x16 */
    unsigned short n1;  /* +0x18 */
    unsigned short v1;  /* +0x1a */
    unsigned short n2;  /* +0x1c */
    unsigned short v2;  /* +0x1e */
    unsigned short n3;  /* +0x20 */
    unsigned short v3;  /* +0x22 */
};

struct TMD_P_TNF3 {  /* size 28 */
    unsigned char out;  /* +0x0 */
    unsigned char in;  /* +0x1 */
    unsigned char dummy;  /* +0x2 */
    unsigned char cd;  /* +0x3 */
    unsigned char tu0;  /* +0x4 */
    unsigned char tv0;  /* +0x5 */
    unsigned short clut;  /* +0x6 */
    unsigned char tu1;  /* +0x8 */
    unsigned char tv1;  /* +0x9 */
    unsigned short tpage;  /* +0xa */
    unsigned char tu2;  /* +0xc */
    unsigned char tv2;  /* +0xd */
    unsigned short p0;  /* +0xe */
    unsigned char r0;  /* +0x10 */
    unsigned char g0;  /* +0x11 */
    unsigned char b0;  /* +0x12 */
    unsigned char p1;  /* +0x13 */
    unsigned short v0;  /* +0x14 */
    unsigned short v1;  /* +0x16 */
    unsigned short v2;  /* +0x18 */
    unsigned short p2;  /* +0x1a */
};

struct TMD_P_TNF4 {  /* size 32 */
    unsigned char out;  /* +0x0 */
    unsigned char in;  /* +0x1 */
    unsigned char dummy;  /* +0x2 */
    unsigned char cd;  /* +0x3 */
    unsigned char tu0;  /* +0x4 */
    unsigned char tv0;  /* +0x5 */
    unsigned short clut;  /* +0x6 */
    unsigned char tu1;  /* +0x8 */
    unsigned char tv1;  /* +0x9 */
    unsigned short tpage;  /* +0xa */
    unsigned char tu2;  /* +0xc */
    unsigned char tv2;  /* +0xd */
    unsigned short p0;  /* +0xe */
    unsigned char tu3;  /* +0x10 */
    unsigned char tv3;  /* +0x11 */
    unsigned short p1;  /* +0x12 */
    unsigned char r0;  /* +0x14 */
    unsigned char g0;  /* +0x15 */
    unsigned char b0;  /* +0x16 */
    unsigned char p2;  /* +0x17 */
    unsigned short v0;  /* +0x18 */
    unsigned short v1;  /* +0x1a */
    unsigned short v2;  /* +0x1c */
    unsigned short v3;  /* +0x1e */
};

struct TMD_P_TNG3 {  /* size 36 */
    unsigned char out;  /* +0x0 */
    unsigned char in;  /* +0x1 */
    unsigned char dummy;  /* +0x2 */
    unsigned char cd;  /* +0x3 */
    unsigned char tu0;  /* +0x4 */
    unsigned char tv0;  /* +0x5 */
    unsigned short clut;  /* +0x6 */
    unsigned char tu1;  /* +0x8 */
    unsigned char tv1;  /* +0x9 */
    unsigned short tpage;  /* +0xa */
    unsigned char tu2;  /* +0xc */
    unsigned char tv2;  /* +0xd */
    unsigned short p0;  /* +0xe */
    unsigned char r0;  /* +0x10 */
    unsigned char g0;  /* +0x11 */
    unsigned char b0;  /* +0x12 */
    unsigned char p1;  /* +0x13 */
    unsigned char r1;  /* +0x14 */
    unsigned char g1;  /* +0x15 */
    unsigned char b1;  /* +0x16 */
    unsigned char p2;  /* +0x17 */
    unsigned char r2;  /* +0x18 */
    unsigned char g2;  /* +0x19 */
    unsigned char b2;  /* +0x1a */
    unsigned char p3;  /* +0x1b */
    unsigned short v0;  /* +0x1c */
    unsigned short v1;  /* +0x1e */
    unsigned short v2;  /* +0x20 */
    unsigned short p4;  /* +0x22 */
};

struct TMD_P_TNG4 {  /* size 44 */
    unsigned char out;  /* +0x0 */
    unsigned char in;  /* +0x1 */
    unsigned char dummy;  /* +0x2 */
    unsigned char cd;  /* +0x3 */
    unsigned char tu0;  /* +0x4 */
    unsigned char tv0;  /* +0x5 */
    unsigned short clut;  /* +0x6 */
    unsigned char tu1;  /* +0x8 */
    unsigned char tv1;  /* +0x9 */
    unsigned short tpage;  /* +0xa */
    unsigned char tu2;  /* +0xc */
    unsigned char tv2;  /* +0xd */
    unsigned short p0;  /* +0xe */
    unsigned char tu3;  /* +0x10 */
    unsigned char tv3;  /* +0x11 */
    unsigned short p1;  /* +0x12 */
    unsigned char r0;  /* +0x14 */
    unsigned char g0;  /* +0x15 */
    unsigned char b0;  /* +0x16 */
    unsigned char p2;  /* +0x17 */
    unsigned char r1;  /* +0x18 */
    unsigned char g1;  /* +0x19 */
    unsigned char b1;  /* +0x1a */
    unsigned char p3;  /* +0x1b */
    unsigned char r2;  /* +0x1c */
    unsigned char g2;  /* +0x1d */
    unsigned char b2;  /* +0x1e */
    unsigned char p4;  /* +0x1f */
    unsigned char r3;  /* +0x20 */
    unsigned char g3;  /* +0x21 */
    unsigned char b3;  /* +0x22 */
    unsigned char p5;  /* +0x23 */
    unsigned short v0;  /* +0x24 */
    unsigned short v1;  /* +0x26 */
    unsigned short v2;  /* +0x28 */
    unsigned short v3;  /* +0x2a */
};

struct TMD_STRUCT {  /* size 28 */
    unsigned long *vertop;  /* +0x0 */
    unsigned long vern;  /* +0x4 */
    unsigned long *nortop;  /* +0x8 */
    unsigned long norn;  /* +0xc */
    unsigned long *primtop;  /* +0x10 */
    unsigned long primn;  /* +0x14 */
    unsigned long scale;  /* +0x18 */
};

struct TMESH {  /* size 20 */
    struct SVECTOR *v;  /* +0x0 */
    struct SVECTOR *n;  /* +0x4 */
    struct SVECTOR *u;  /* +0x8 */
    struct CVECTOR *c;  /* +0xc */
    unsigned long len;  /* +0x10 */
};

struct TMakeDifInfo {  /* size 12 */
    short div;  /* +0x0 */
    short spd;  /* +0x2 */
    struct SVECTOR bef;  /* +0x4 */
};

enum TMiscMessage {  /* size 4 */
    MM_CREATE = 0,
    MM_DESTROY = 1,
    MM_PAUSE = 2,
    MM_RESUME = 3,
    MM_DO = 4,
};

struct TMusicTable {  /* size 8 */
    unsigned char *file;  /* +0x0 */
    unsigned char channel;  /* +0x4 */
    unsigned char min;  /* +0x5 */
    unsigned char sec;  /* +0x6 */
};

struct TPadPort {  /* size 12 */
    unsigned short button;  /* +0x0 */
    short x;  /* +0x2 */
    short y;  /* +0x4 */
    unsigned char fAnalog;  /* +0x6 */
    unsigned char act1;  /* +0x7 */
    unsigned char act2;  /* +0x8 */
    unsigned char actbuf[2];  /* +0x9 */
    unsigned char Send;  /* +0xb */
};

struct TPitfall {  /* size 8 */
    struct ModelType *locate;  /* +0x0 */
    short r;  /* +0x4 */
    unsigned char type;  /* +0x6 */
};

struct TPoint {  /* size 8 */
    long x;  /* +0x0 */
    long y;  /* +0x4 */
};

enum TRequestItem {  /* size 4 */
    REQ_ITEM_USE = 0,
    REQ_ITEM_CANCEL = 1,
    REQ_ITEM_QUERY_USING = 2,
    REQ_ITEM_LAUNCH = 3,
    REQ_ITEM_DROP = 4,
    REQ_ITEM_ITEMCOUNT = 5,
};

enum TSeekMode {  /* size 4 */
    CDSEEK_SET = 0,
    CDSEEK_CUR = 1,
    CDSEEK_END = 2,
};

struct TSnowfall {  /* size 12 */
    int w;  /* +0x0 */
    int h;  /* +0x4 */
    struct SVECTOR *snows;  /* +0x8 */
};

struct TSprite {  /* size 1 */
    unsigned char type;  /* +0x0 */
};

struct TStageConfig {  /* size 28 */
    unsigned char uid;  /* +0x0 */
    unsigned char *name;  /* +0x4 */
    unsigned char *path;  /* +0x8 */
    long px;  /* +0xc */
    long py;  /* +0x10 */
    long pz;  /* +0x14 */
    long pr;  /* +0x18 */
};

enum TSystemFlag {  /* size 4 */
    SYSFLAG_DEBUGPRINT = 1,
    SYSFLAG_DEBUGMODE = 2,
    SYSFLAG_PAUSE = 4,
};

struct TVoiceTable {  /* size 6 */
    unsigned char no;  /* +0x0 */
    unsigned char channel;  /* +0x1 */
    unsigned char smin;  /* +0x2 */
    unsigned char ssec;  /* +0x3 */
    unsigned char emin;  /* +0x4 */
    unsigned char esec;  /* +0x5 */
};

struct TexScroll {  /* size 28 */
    short px;  /* +0x0 */
    short py;  /* +0x2 */
    short vx;  /* +0x4 */
    short vy;  /* +0x6 */
    short time;  /* +0x8 */
    short count;  /* +0xa */
    short x;  /* +0xc */
    short y;  /* +0xe */
    short sx;  /* +0x10 */
    short sy;  /* +0x12 */
    struct RECT image;  /* +0x14 */
};

struct ThinkDBtype {  /* size 8 */
    unsigned char *name;  /* +0x0 */
    short value;  /* +0x4 */
};

struct ToT {  /* size 8 */
    unsigned long *head;  /* +0x0 */
    long size;  /* +0x4 */
};

struct TraceLine {  /* size 8 */
    short index;  /* +0x0 */
    short count;  /* +0x2 */
    struct TracePoint *point;  /* +0x4 */
};

struct TracePoint {  /* size 12 */
    long x;  /* +0x0 */
    long z;  /* +0x4 */
    short range;  /* +0x8 */
    short pad;  /* +0xa */
};

struct VECTOR {  /* size 16 */
    long vx;  /* +0x0 */
    long vy;  /* +0x4 */
    long vz;  /* +0x8 */
    long pad;  /* +0xc */
};

struct VERT {  /* size 8 */
    short vx;  /* +0x0 */
    short vy;  /* +0x2 */
    short vz;  /* +0x4 */
    unsigned char tu;  /* +0x6 */
    unsigned char tv;  /* +0x7 */
};

struct VERTC {  /* size 12 */
    short vx;  /* +0x0 */
    short vy;  /* +0x2 */
    short vz;  /* +0x4 */
    unsigned char tu;  /* +0x6 */
    unsigned char tv;  /* +0x7 */
    struct CVECTOR col;  /* +0x8 */
};

struct VMhead {  /* size 8 */
    unsigned long size;  /* +0x0 */
    struct VMhead *next;  /* +0x4 */
};

struct VabHdr {  /* size 32 */
    long form;  /* +0x0 */
    long ver;  /* +0x4 */
    long id;  /* +0x8 */
    unsigned long fsize;  /* +0xc */
    unsigned short reserved0;  /* +0x10 */
    unsigned short ps;  /* +0x12 */
    unsigned short ts;  /* +0x14 */
    unsigned short vs;  /* +0x16 */
    unsigned char mvol;  /* +0x18 */
    unsigned char pan;  /* +0x19 */
    unsigned char attr1;  /* +0x1a */
    unsigned char attr2;  /* +0x1b */
    unsigned long reserved1;  /* +0x1c */
};

struct VagAtr {  /* size 32 */
    unsigned char prior;  /* +0x0 */
    unsigned char mode;  /* +0x1 */
    unsigned char vol;  /* +0x2 */
    unsigned char pan;  /* +0x3 */
    unsigned char center;  /* +0x4 */
    unsigned char shift;  /* +0x5 */
    unsigned char min;  /* +0x6 */
    unsigned char max;  /* +0x7 */
    unsigned char vibW;  /* +0x8 */
    unsigned char vibT;  /* +0x9 */
    unsigned char porW;  /* +0xa */
    unsigned char porT;  /* +0xb */
    unsigned char pbmin;  /* +0xc */
    unsigned char pbmax;  /* +0xd */
    unsigned char reserved1;  /* +0xe */
    unsigned char reserved2;  /* +0xf */
    unsigned short adsr1;  /* +0x10 */
    unsigned short adsr2;  /* +0x12 */
    short prog;  /* +0x14 */
    short vag;  /* +0x16 */
    short reserved[4];  /* +0x18 */
};

enum WORLD__182fake {  /* size 4 */
    CDA_ONCE = 0,
    CDA_REPEAT = 1,
};

enum WORLD__183fake {  /* size 4 */
    CDA_FLAG_ACTIVE = 1,
};

enum WORLD__185fake {  /* size 4 */
    IMG_BLOOD_STAY = 0,
    IMG_SMOKE = 1,
    IMG_BOMB0 = 2,
    IMG_BOMB1 = 3,
    IMG_BOMB2 = 4,
    IMG_SLASH = 5,
    IMG_GAUGE = 6,
    IMG_ENEMYBAR = 7,
    IMG_ICON_SYURIKEN = 8,
    IMG_ICON_POTIONS = 9,
    IMG_ICON_SMOKE = 10,
    IMG_ICON_FIRE = 11,
    IMG_ICON_MAKIBISHI = 12,
    IMG_ICON_RIKIMARUKO = 13,
    IMG_ICON_KAGINAWA = 14,
    IMG_ICON_HENSHIN = 15,
    IMG_ICON_KAWARIMI = 16,
    IMG_ICON_JIRAI = 17,
    IMG_CURSOR = 18,
    IMG_FONT_NUMBER = 19,
    IMG_KEHAI_GREEN = 20,
    IMG_SIGHT = 21,
    IMG_MISC_FIRE1 = 22,
    IMG_MISC_FIRE2 = 23,
    IMG_MISC_SNOW = 24,
    IMG_SCROLL_WATER = 25,
    IMG_SCROLL_MAGUMA = 26,
    IMG_SCROLL_SEA = 27,
    IMG_ICON_DOKUDANGO = 28,
    IMG_SPLASH = 29,
    IMG_GUNFIRE = 30,
    IMG_FRAME0 = 31,
    IMG_FRAME1 = 32,
    IMG_FRAME2 = 33,
    IMG_FRAME3 = 34,
    IMG_BLOOD_FLY = 35,
    IMG_GUARD = 36,
    IMG_HIT = 37,
    IMG_KEHAI_YELLOW = 38,
    IMG_KEHAI_RED = 39,
    IMG_GOSHIKIMAI = 40,
    IMG_ICON_GOSHIKIMAI = 41,
    IMG_ICON_HAPPOU = 42,
    IMG_ICON_NEMURI = 43,
    IMG_ICON_KAENGEKI = 44,
    IMG_ICON_SHINSOKU = 45,
    IMG_ICON_GOSIN = 46,
    IMG_ICON_MANEBUE = 47,
    IMG_ICON_NINKEN = 48,
    IMG_SCROLL_WARP = 49,
    IMG_LOADING = 50,
    IMG_TENCHU = 51,
    IMG_N = 52,
};

enum WORLD__186fake {  /* size 4 */
    MODEL_MON6B = 0,
    MODEL_MON6A = 1,
    MODEL_DOORZ00 = 2,
    MODEL_DOORZ01 = 3,
    MODEL_MON5B = 4,
    MODEL_MON5A = 5,
    MODEL_MONB = 6,
    MODEL_MONA = 7,
    MODEL_MON2B = 8,
    MODEL_MON2A = 9,
    MODEL_MON3B = 10,
    MODEL_MON3A = 11,
    MODEL_MON01 = 12,
    MODEL_MON00 = 13,
    MODEL_GMON01 = 14,
    MODEL_GMON00 = 15,
    MODEL_AKI01 = 16,
    MODEL_AKI00 = 17,
    MODEL_OTO_L = 18,
    MODEL_OTO_R = 19,
    MODEL_SYURIKEN = 20,
    MODEL_ARROW = 21,
    ICON_CARD1 = 22,
    ICON_CARD2 = 23,
    ICON_CARD3 = 24,
    MODEL_SHADOW = 25,
    MODEL_KAGIHEAD = 26,
    MODEL_NINGYO = 27,
    MODEL_HAPPOU = 28,
    MODEL_AKINa = 29,
    MODEL_AKINb = 30,
    MODEL_N = 31,
};

enum WORLD__187fake {  /* size 4 */
    MUSIC_STAGE1 = 0,
    MUSIC_STAGE2 = 1,
    MUSIC_STAGE3 = 2,
    MUSIC_STAGE4 = 3,
    MUSIC_STAGE5 = 4,
    MUSIC_STAGE6 = 5,
    MUSIC_STAGE7 = 6,
    MUSIC_STAGE8 = 7,
    MUSIC_STAGE9 = 8,
    MUSIC_GAMEOVER = 9,
    MUSIC_COMPLETE = 10,
    MUSIC_KIKI = 11,
    MUSIC_TITLE = 12,
    MUSIC_CHARA = 13,
    MUSIC_BARMAR = 14,
    MUSIC_MEIOU = 15,
    MUSIC_STAGE_OPEN1 = 16,
    MUSIC_STAGE_OPEN2 = 17,
    MUSIC_STAGE_OPEN3 = 18,
    MUSIC_STAGE_OPEN4 = 19,
    MUSIC_STAGE_OPEN5 = 20,
    MUSIC_STAGE_OPEN6 = 21,
    MUSIC_STAGE_OPEN7 = 22,
    MUSIC_STAGE_OPEN8 = 23,
    MUSIC_STAGE_OPEN7A = 24,
    MUSIC_STAGE_OPEN8A = 25,
    MUSIC_N = 26,
};

struct WORLD__195fake {  /* size 28 */
    unsigned char name[12];  /* +0x0 */
    long x;  /* +0xc */
    long y;  /* +0x10 */
    long z;  /* +0x14 */
    long r;  /* +0x18 */
};

struct WORLD__196fake {  /* size 28 */
    long type;  /* +0x0 */
    long x;  /* +0x4 */
    long y;  /* +0x8 */
    long z;  /* +0xc */
    long a;  /* +0x10 */
    long b;  /* +0x14 */
    long c;  /* +0x18 */
};

union WORLD__197fake {  /* size 28 */
    struct WORLD__195fake common;  /* +0x0 */
    long pathxz[7];  /* +0x0 */
    unsigned char data[28];  /* +0x0 */
    struct WORLD__196fake effect;  /* +0x0 */
};

enum WORLD__200fake {  /* size 4 */
    TITLE_X = 32,
    TITLE_Y = 50,
};

enum WORLD__201fake {  /* size 4 */
    ENESIZE = 5000,
    ITEMSIZE = 2000,
};

enum WORLD__202fake {  /* size 4 */
    MapModelSize = 460800,
};

enum WORLD__204fake {  /* size 4 */
    SXW = 160,
    SYW = 120,
};

enum WORLD__205fake {  /* size 4 */
    NEAR = 150,
};

enum WORLD__206fake {  /* size 4 */
    dlt = 15000,
};

struct WeaponModelType {  /* size 12 */
    unsigned char *name;  /* +0x0 */
    short wid;  /* +0x4 */
    unsigned long *model;  /* +0x8 */
};

struct WeaponType {  /* size 24 */
    struct SVECTOR confp;  /* +0x0 */
    struct SVECTOR ilup0;  /* +0x8 */
    struct SVECTOR ilup1;  /* +0x10 */
};

struct WorldDataType {  /* size 32 */
    short mode;  /* +0x0 */
    short nid;  /* +0x2 */
    union WORLD__197fake real;  /* +0x4 */
};

struct WorldType {  /* size 4 */
    struct tag_ObjectSlotType *top;  /* +0x0 */
};

struct XF_HDR {  /* size 136 */
    unsigned char key[8];  /* +0x0 */
    unsigned long text;  /* +0x8 */
    unsigned long data;  /* +0xc */
    struct EXEC exec;  /* +0x10 */
    unsigned char title[60];  /* +0x4c */
};

struct _GsCOORDINATE2 {  /* size 80 */
    unsigned long flg;  /* +0x0 */
    struct MATRIX coord;  /* +0x4 */
    struct MATRIX workm;  /* +0x24 */
    struct GsCOORD2PARAM *param;  /* +0x44 */
    struct _GsCOORDINATE2 *super;  /* +0x48 */
    struct _GsCOORDINATE2 *sub;  /* +0x4c */
};

struct _GsCOORDUNIT {  /* size 80 */
    unsigned long flg;  /* +0x0 */
    struct MATRIX matrix;  /* +0x4 */
    struct MATRIX workm;  /* +0x24 */
    struct SVECTOR rot;  /* +0x44 */
    struct _GsCOORDUNIT *super;  /* +0x4c */
};

struct _GsFCALL {  /* size 304 */
    unsigned char *(*f3[2][3])();  /* +0x0 */
    unsigned char *(*nf3[2])();  /* +0x18 */
    unsigned char *(*g3[2][3])();  /* +0x20 */
    unsigned char *(*ng3[2])();  /* +0x38 */
    unsigned char *(*tf3[2][3])();  /* +0x40 */
    unsigned char *(*ntf3[2])();  /* +0x58 */
    unsigned char *(*tg3[2][3])();  /* +0x60 */
    unsigned char *(*ntg3[2])();  /* +0x78 */
    unsigned char *(*f4[2][3])();  /* +0x80 */
    unsigned char *(*nf4[2])();  /* +0x98 */
    unsigned char *(*g4[2][3])();  /* +0xa0 */
    unsigned char *(*ng4[2])();  /* +0xb8 */
    unsigned char *(*tf4[2][3])();  /* +0xc0 */
    unsigned char *(*ntf4[2])();  /* +0xd8 */
    unsigned char *(*tg4[2][3])();  /* +0xe0 */
    unsigned char *(*ntg4[2])();  /* +0xf8 */
    unsigned char *(*f3g[3])();  /* +0x100 */
    unsigned char *(*g3g[3])();  /* +0x10c */
    unsigned char *(*f4g[3])();  /* +0x118 */
    unsigned char *(*g4g[3])();  /* +0x124 */
};

struct _GsPOSITION {  /* size 4 */
    short offx;  /* +0x0 */
    short offy;  /* +0x2 */
};

struct _SsFCALL {  /* size 148 */
    void (*noteon)();  /* +0x0 */
    void (*programchange)();  /* +0x4 */
    void (*pitchbend)();  /* +0x8 */
    void (*metaevent)();  /* +0xc */
    void (*control[13])();  /* +0x10 */
    void (*ccentry[20])();  /* +0x44 */
};

struct _physadr {  /* size 4 */
    int r[1];  /* +0x0 */
};

struct _quad {  /* size 8 */
    long val[2];  /* +0x0 */
};

struct label_t {  /* size 48 */
    int val[12];  /* +0x0 */
};

struct param_arrow {  /* size 48 */
    struct param_fly fly;  /* +0x0 */
    unsigned char count;  /* +0x2c */
};

struct param_dokudango {  /* size 24 */
    struct param_korogari koro;  /* +0x0 */
    struct Humanoid *eater;  /* +0xc */
    void *org_think;  /* +0x10 */
    unsigned char count;  /* +0x14 */
};

struct param_drop {  /* size 16 */
    struct param_korogari koro;  /* +0x0 */
    unsigned char count;  /* +0xc */
};

struct param_fly {  /* size 44 */
    union ITEM__184fake p;  /* +0x0 */
    unsigned char mode;  /* +0x28 */
};

struct param_goshikimai {  /* size 8 */
    struct SVECTOR vec;  /* +0x0 */
};

struct param_gosin {  /* size 2 */
    short count;  /* +0x0 */
};

struct param_gun {  /* size 16 */
    struct VECTOR vec;  /* +0x0 */
};

struct param_henshin {  /* size 4 */
    short count;  /* +0x0 */
    unsigned char lock;  /* +0x2 */
};

struct param_kaengeki {  /* size 36 */
    struct VECTOR start;  /* +0x0 */
    struct VECTOR end;  /* +0x10 */
    unsigned char count;  /* +0x20 */
};

struct param_korogari {  /* size 12 */
    struct AreaNodeType *hint;  /* +0x0 */
    short vx;  /* +0x4 */
    short vy;  /* +0x6 */
    short vz;  /* +0x8 */
    unsigned char status;  /* +0xa */
};

struct param_launch {  /* size 52 */
    struct param_fly fly;  /* +0x0 */
    struct AfterimageType *effect;  /* +0x2c */
    unsigned char count;  /* +0x30 */
};

struct param_lightningbolt {  /* size 28 */
    struct VECTOR start;  /* +0x0 */
    struct SVECTOR rot;  /* +0x10 */
    unsigned char count;  /* +0x18 */
};

struct param_napalm {  /* size 10 */
    struct SVECTOR vec;  /* +0x0 */
    unsigned char count;  /* +0x8 */
};

struct param_ningyo {  /* size 16 */
    struct param_korogari koro;  /* +0x0 */
    unsigned char count;  /* +0xc */
    unsigned char hp;  /* +0xd */
};

struct param_ninken {  /* size 20 */
    struct param_korogari koro;  /* +0x0 */
    struct Humanoid *slave;  /* +0xc */
    short count;  /* +0x10 */
};

struct param_shinsoku {  /* size 10 */
    struct SVECTOR vec;  /* +0x0 */
    unsigned char count;  /* +0x8 */
};

struct param_smoke {  /* size 16 */
    struct param_korogari koro;  /* +0x0 */
    unsigned char count;  /* +0xc */
};

struct tag_EffectSlot {  /* size 76 */
    void (*proc)();  /* +0x0 */
    union EFFECT__180fake param;  /* +0x4 */
};

struct tag_ObjectSlotType {  /* size 12 */
    struct tag_ObjectSlotType *next;  /* +0x0 */
    struct OrnamentType *model;  /* +0x4 */
    short ModelSize;  /* +0x8 */
    short ShiftY;  /* +0xa */
};

struct tag_TItem {  /* size 88 */
    struct Humanoid *owner;  /* +0x0 */
    struct ModelType *model;  /* +0x4 */
    enum TItemType type;  /* +0x8 */
    void (*proc)();  /* +0xc */
    struct ModelType *locate;  /* +0x10 */
    struct ITEM__201fake collision;  /* +0x14 */
    union ITEM__202fake param;  /* +0x20 */
    unsigned char mode;  /* +0x54 */
};

struct tag_TMisc {  /* size 36 */
    void (*proc)();  /* +0x0 */
    int x;  /* +0x4 */
    int y;  /* +0x8 */
    int z;  /* +0xc */
    int count;  /* +0x10 */
    unsigned char pause;  /* +0x14 */
    unsigned char mode;  /* +0x15 */
    union MISC__181fake param;  /* +0x18 */
};

struct tag_fly {  /* size 40 */
    long sx;  /* +0x0 */
    long sy;  /* +0x4 */
    long sz;  /* +0x8 */
    long vx;  /* +0xc */
    long vy;  /* +0x10 */
    long vz;  /* +0x14 */
    long rx;  /* +0x18 */
    long ry;  /* +0x1c */
    long rz;  /* +0x20 */
    unsigned char count;  /* +0x24 */
    unsigned char count2;  /* +0x25 */
};

typedef unsigned int size_t;
typedef unsigned char u_char;
typedef unsigned short u_short;
typedef unsigned int u_int;
typedef unsigned long u_long;
typedef unsigned short ushort;
typedef struct _physadr *physadr;
typedef struct label_t label_t;
typedef struct _quad quad;
typedef long daddr_t;
typedef unsigned char *caddr_t;
typedef long *qaddr_t;
typedef unsigned long ino_t;
typedef long swblk_t;
typedef long time_t;
typedef short dev_t;
typedef long off_t;
typedef unsigned short uid_t;
typedef unsigned short gid_t;
typedef struct MATRIX MATRIX;
typedef struct VECTOR VECTOR;
typedef struct SVECTOR SVECTOR;
typedef struct CVECTOR CVECTOR;
typedef struct DVECTOR DVECTOR;
typedef struct EVECTOR EVECTOR;
typedef struct RVECTOR RVECTOR;
typedef struct CRVECTOR3 CRVECTOR3;
typedef struct DIVPOLYGON3 DIVPOLYGON3;
typedef struct CRVECTOR4 CRVECTOR4;
typedef struct DIVPOLYGON4 DIVPOLYGON4;
typedef struct SPOL SPOL;
typedef struct POL4 POL4;
